*** crates/core/src/bm25.rs:58:9: replace Bm25::idf -> f32 with -1.0

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace Bm25::idf -> f32 with -1.0
@@ -50,19 +50,17 @@
     /// idf = ln(1 + (N - df + 0.5) / (df + 0.5))
     /// ```
     ///
     /// The `+1` inside the logarithm is what keeps the result non-negative: the
     /// raw probabilistic formula goes negative for terms present in more than
     /// half of the collection, which would let a common term *subtract* from a
     /// document's score.
     pub fn idf(&self, doc_freq: u32, total_docs: usize) -> f32 {
-        let n = total_docs as f32;
-        let df = doc_freq as f32;
-        (1.0 + (n - df + 0.5) / (df + 0.5)).ln()
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Score contributed by one term occurring `tf` times in a document of
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------

---- bm25::tests::idf_never_goes_negative_for_ubiquitous_terms stdout ----

thread 'bm25::tests::idf_never_goes_negative_for_ubiquitous_terms' (12793709) panicked at crates/core/src/bm25.rs:96:9:
assertion failed: bm25.idf(1_000, 1_000) >= 0.0

---- bm25::tests::idf_falls_as_the_term_becomes_common stdout ----

thread 'bm25::tests::idf_falls_as_the_term_becomes_common' (12793708) panicked at crates/core/src/bm25.rs:90:9:
-1 should beat -1

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12793735) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    bm25::tests::idf_falls_as_the_term_becomes_common
    bm25::tests::idf_never_goes_negative_for_ubiquitous_terms
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking

test result: FAILED. 119 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
