*** crates/core/src/bm25.rs:58:9: replace Bm25::idf -> f32 with 1.0

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace Bm25::idf -> f32 with 1.0
@@ -50,19 +50,17 @@
     /// idf = ln(1 + (N - df + 0.5) / (df + 0.5))
     /// ```
     ///
     /// The `+1` inside the logarithm is what keeps the result non-negative: the
     /// raw probabilistic formula goes negative for terms present in more than
     /// half of the collection, which would let a common term *subtract* from a
     /// document's score.
     pub fn idf(&self, doc_freq: u32, total_docs: usize) -> f32 {
-        let n = total_docs as f32;
-        let df = doc_freq as f32;
-        (1.0 + (n - df + 0.5) / (df + 0.5)).ln()
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Score contributed by one term occurring `tf` times in a document of
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------

---- bm25::tests::idf_falls_as_the_term_becomes_common stdout ----

thread 'bm25::tests::idf_falls_as_the_term_becomes_common' (12795311) panicked at crates/core/src/bm25.rs:90:9:
1 should beat 1

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12795454) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    bm25::tests::idf_falls_as_the_term_becomes_common
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
