*** crates/core/src/bm25.rs:60:24: replace + with - in Bm25::idf

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace + with - in Bm25::idf
@@ -52,17 +52,17 @@
     ///
     /// The `+1` inside the logarithm is what keeps the result non-negative: the
     /// raw probabilistic formula goes negative for terms present in more than
     /// half of the collection, which would let a common term *subtract* from a
     /// document's score.
     pub fn idf(&self, doc_freq: u32, total_docs: usize) -> f32 {
         let n = total_docs as f32;
         let df = doc_freq as f32;
-        (1.0 + (n - df + 0.5) / (df + 0.5)).ln()
+        (1.0 + (n - df - /* ~ changed by cargo-mutants ~ */ 0.5) / (df + 0.5)).ln()
     }
 
     /// Score contributed by one term occurring `tf` times in a document of
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------

---- bm25::tests::idf_never_goes_negative_for_ubiquitous_terms stdout ----

thread 'bm25::tests::idf_never_goes_negative_for_ubiquitous_terms' (12791728) panicked at crates/core/src/bm25.rs:98:9:
assertion failed: bm25.idf(1_000, 1_000) >= 0.0

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12791756) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- searcher::tests::limit_truncates_the_ranking stdout ----

thread 'searcher::tests::limit_truncates_the_ranking' (12791884) panicked at crates/core/src/searcher.rs:523:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    bm25::tests::idf_never_goes_negative_for_ubiquitous_terms
    engine::tests::a_shared_term_ranks_both_documents
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_new_service_serves_generation_one
    service::tests::a_snapshot_keeps_answering_from_the_generation_it_took
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    service::tests::reindexing_publishes_the_next_generation
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps
    store::tests::a_reloaded_index_still_answers_queries

test result: FAILED. 126 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
