*** crates/core/src/bm25.rs:60:31: replace / with % in Bm25::idf

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace / with % in Bm25::idf
@@ -52,17 +52,17 @@
     ///
     /// The `+1` inside the logarithm is what keeps the result non-negative: the
     /// raw probabilistic formula goes negative for terms present in more than
     /// half of the collection, which would let a common term *subtract* from a
     /// document's score.
     pub fn idf(&self, doc_freq: u32, total_docs: usize) -> f32 {
         let n = total_docs as f32;
         let df = doc_freq as f32;
-        (1.0 + (n - df + 0.5) / (df + 0.5)).ln()
+        (1.0 + (n - df + 0.5) % /* ~ changed by cargo-mutants ~ */ (df + 0.5)).ln()
     }
 
     /// Score contributed by one term occurring `tf` times in a document of
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12788958) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12788982) panicked at crates/core/src/engine.rs:426:9:
assertion `left == right` failed
  left: 0
 right: 1

---- searcher::tests::documents_matching_more_clauses_rank_higher stdout ----

thread 'searcher::tests::documents_matching_more_clauses_rank_higher' (12789025) panicked at crates/core/src/searcher.rs:489:26:
index out of bounds: the len is 0 but the index is 0

failures:
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::optional_terms_match_any_document
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 133 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
