*** crates/core/src/bm25.rs:60:31: replace / with * in Bm25::idf

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace / with * in Bm25::idf
@@ -52,17 +52,17 @@
     ///
     /// The `+1` inside the logarithm is what keeps the result non-negative: the
     /// raw probabilistic formula goes negative for terms present in more than
     /// half of the collection, which would let a common term *subtract* from a
     /// document's score.
     pub fn idf(&self, doc_freq: u32, total_docs: usize) -> f32 {
         let n = total_docs as f32;
         let df = doc_freq as f32;
-        (1.0 + (n - df + 0.5) / (df + 0.5)).ln()
+        (1.0 + (n - df + 0.5) * /* ~ changed by cargo-mutants ~ */ (df + 0.5)).ln()
     }
 
     /// Score contributed by one term occurring `tf` times in a document of
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------

---- bm25::tests::idf_falls_as_the_term_becomes_common stdout ----

thread 'bm25::tests::idf_falls_as_the_term_becomes_common' (12790485) panicked at crates/core/src/bm25.rs:92:9:
7.313387 should beat 12.431219

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12790678) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12790647) panicked at crates/core/src/searcher.rs:632:13:
assertion `left == right` failed: k1=0 b=0 changed the ranking
  left: [80, 96, 112, 128, 144, 0, 16, 32, 48, 64]
 right: [80, 96, 112, 128, 144, 160, 176, 192, 208, 224]

failures:
    bm25::tests::idf_falls_as_the_term_becomes_common
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 135 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
