*** crates/core/src/bm25.rs:60:37: replace + with * in Bm25::idf

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace + with * in Bm25::idf
@@ -52,17 +52,17 @@
     ///
     /// The `+1` inside the logarithm is what keeps the result non-negative: the
     /// raw probabilistic formula goes negative for terms present in more than
     /// half of the collection, which would let a common term *subtract* from a
     /// document's score.
     pub fn idf(&self, doc_freq: u32, total_docs: usize) -> f32 {
         let n = total_docs as f32;
         let df = doc_freq as f32;
-        (1.0 + (n - df + 0.5) / (df + 0.5)).ln()
+        (1.0 + (n - df + 0.5) / (df * /* ~ changed by cargo-mutants ~ */ 0.5)).ln()
     }
 
     /// Score contributed by one term occurring `tf` times in a document of
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------

*** result: Success
