*** crates/core/src/bm25.rs:72:9: replace Bm25::score -> f32 with 0.0

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace Bm25::score -> f32 with 0.0
@@ -64,22 +64,17 @@
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
-        if tf == 0 || avg_doc_len <= 0.0 {
-            return 0.0;
-        }
-        let tf = tf as f32;
-        let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::term_frequency_saturates stdout ----

thread 'bm25::tests::term_frequency_saturates' (12799421) panicked at crates/core/src/bm25.rs:104:9:
assertion failed: two > one

---- bm25::tests::short_documents_outrank_long_ones_for_the_same_match stdout ----

thread 'bm25::tests::short_documents_outrank_long_ones_for_the_same_match' (12799418) panicked at crates/core/src/bm25.rs:117:9:
assertion failed: short > long

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12799416) panicked at crates/core/src/bm25.rs:134:9:
assertion `left == right` failed
  left: 0.0
 right: 2.0

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary
    bm25::tests::short_documents_outrank_long_ones_for_the_same_match
    bm25::tests::term_frequency_saturates
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document

test result: FAILED. 117 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
