*** crates/core/src/bm25.rs:72:9: replace Bm25::score -> f32 with 1.0

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace Bm25::score -> f32 with 1.0
@@ -64,22 +64,17 @@
     /// `doc_len` terms.
     ///
     /// ```text
     ///                    tf * (k1 + 1)
     /// score = idf * ---------------------------------
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
-        if tf == 0 || avg_doc_len <= 0.0 {
-            return 0.0;
-        }
-        let tf = tf as f32;
-        let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::absent_terms_and_empty_indexes_score_zero stdout ----

thread 'bm25::tests::absent_terms_and_empty_indexes_score_zero' (12801747) panicked at crates/core/src/bm25.rs:140:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- bm25::tests::short_documents_outrank_long_ones_for_the_same_match stdout ----

thread 'bm25::tests::short_documents_outrank_long_ones_for_the_same_match' (12801753) panicked at crates/core/src/bm25.rs:117:9:
assertion failed: short > long

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12801751) panicked at crates/core/src/bm25.rs:134:9:
assertion `left == right` failed
  left: 1.0
 right: 2.0

failures:
    bm25::tests::absent_terms_and_empty_indexes_score_zero
    bm25::tests::k1_zero_makes_term_frequency_binary
    bm25::tests::short_documents_outrank_long_ones_for_the_same_match
    bm25::tests::term_frequency_saturates
    searcher::tests::block_max_bounds_skip_whole_blocks

test result: FAILED. 133 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
