*** crates/core/src/bm25.rs:76:24: replace - with / in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace - with / in Bm25::score
@@ -68,17 +68,17 @@
     /// score = idf * ---------------------------------
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
-        let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
+        let norm = 1.0 / /* ~ changed by cargo-mutants ~ */ self.b + self.b * (doc_len as f32 / avg_doc_len);
         idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12808678) panicked at crates/core/src/searcher.rs:632:13:
assertion `left == right` failed: k1=0 b=0 changed the ranking
  left: []
 right: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

failures:
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
