*** crates/core/src/bm25.rs:76:33: replace + with * in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace + with * in Bm25::score
@@ -68,17 +68,17 @@
     /// score = idf * ---------------------------------
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
-        let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
+        let norm = 1.0 - self.b * /* ~ changed by cargo-mutants ~ */ self.b * (doc_len as f32 / avg_doc_len);
         idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- bm25::tests::short_documents_outrank_long_ones_for_the_same_match stdout ----

thread 'bm25::tests::short_documents_outrank_long_ones_for_the_same_match' (12806376) panicked at crates/core/src/bm25.rs:122:9:
assertion failed: short > long

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12806494) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12806466) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term0` limit 1: different ranking
  left: 0
 right: 32

failures:
    bm25::tests::short_documents_outrank_long_ones_for_the_same_match
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 133 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
