*** crates/core/src/bm25.rs:76:42: replace * with + in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace * with + in Bm25::score
@@ -68,17 +68,17 @@
     /// score = idf * ---------------------------------
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
-        let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
+        let norm = 1.0 - self.b + self.b + /* ~ changed by cargo-mutants ~ */ (doc_len as f32 / avg_doc_len);
         idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- bm25::tests::b_zero_disables_length_normalisation stdout ----

thread 'bm25::tests::b_zero_disables_length_normalisation' (12809437) panicked at crates/core/src/bm25.rs:130:9:
assertion `left == right` failed
  left: 1.4864866
 right: 0.6470588

failures:
    bm25::tests::b_zero_disables_length_normalisation

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
