*** crates/core/src/bm25.rs:77:13: replace * with / in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace * with / in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf / /* ~ changed by cargo-mutants ~ */ (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::term_frequency_saturates stdout ----

thread 'bm25::tests::term_frequency_saturates' (12816020) panicked at crates/core/src/bm25.rs:109:9:
assertion failed: two > one

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12816017) panicked at crates/core/src/bm25.rs:138:9:
assertion `left == right` failed
  left: 2.0
 right: 0.0008

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12816030) panicked at crates/core/src/cursor.rs:347:9:
assertion failed: cursor.block_upper_bound() <= term_bound

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary
    bm25::tests::term_frequency_saturates
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 131 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
