*** crates/core/src/bm25.rs:77:19: replace * with + in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace * with + in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf * (tf + /* ~ changed by cargo-mutants ~ */ (self.k1 + 1.0)) / (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::term_frequency_saturates stdout ----

thread 'bm25::tests::term_frequency_saturates' (12816635) panicked at crates/core/src/bm25.rs:109:9:
assertion failed: two > one

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12816632) panicked at crates/core/src/bm25.rs:138:9:
assertion `left == right` failed
  left: 4.0
 right: 2.04

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12816777) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term0` limit 1: different ranking
  left: 50
 right: 81

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary
    bm25::tests::term_frequency_saturates
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
