*** crates/core/src/bm25.rs:77:30: replace + with * in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace + with * in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf * (tf * (self.k1 * /* ~ changed by cargo-mutants ~ */ 1.0)) / (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12819063) panicked at crates/core/src/bm25.rs:139:9:
assertion `left == right` failed
  left: 0.0
 right: 2.0

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12819159) panicked at crates/core/src/searcher.rs:632:13:
assertion `left == right` failed: k1=0 b=0 changed the ranking
  left: []
 right: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
