*** crates/core/src/bm25.rs:77:38: replace / with % in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace / with % in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf * (tf * (self.k1 + 1.0)) % /* ~ changed by cargo-mutants ~ */ (tf + self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12812867) panicked at crates/core/src/bm25.rs:139:9:
assertion `left == right` failed
  left: 0.0
 right: 2.0

---- bm25::tests::short_documents_outrank_long_ones_for_the_same_match stdout ----

thread 'bm25::tests::short_documents_outrank_long_ones_for_the_same_match' (12812869) panicked at crates/core/src/bm25.rs:122:9:
assertion failed: short > long

---- bm25::tests::term_frequency_saturates stdout ----

thread 'bm25::tests::term_frequency_saturates' (12812872) panicked at crates/core/src/bm25.rs:112:9:
tf grew linearly: 0 -> 1.2

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary
    bm25::tests::short_documents_outrank_long_ones_for_the_same_match
    bm25::tests::term_frequency_saturates
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 132 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
