*** crates/core/src/bm25.rs:77:44: replace + with * in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace + with * in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf * (tf * (self.k1 + 1.0)) / (tf * /* ~ changed by cargo-mutants ~ */ self.k1 * norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12821197) panicked at crates/core/src/bm25.rs:139:9:
assertion `left == right` failed
  left: inf
 right: 2.0

---- bm25::tests::term_frequency_saturates stdout ----

thread 'bm25::tests::term_frequency_saturates' (12821203) panicked at crates/core/src/bm25.rs:109:9:
assertion failed: two > one

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary
    bm25::tests::term_frequency_saturates

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
