*** crates/core/src/bm25.rs:77:54: replace * with + in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace * with + in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 + /* ~ changed by cargo-mutants ~ */ norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::k1_zero_makes_term_frequency_binary stdout ----

thread 'bm25::tests::k1_zero_makes_term_frequency_binary' (12821648) panicked at crates/core/src/bm25.rs:138:9:
assertion `left == right` failed
  left: 1.0
 right: 1.9607843

failures:
    bm25::tests::k1_zero_makes_term_frequency_binary

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
