*** crates/core/src/bm25.rs:77:54: replace * with / in Bm25::score

*** mutation diff:
--- crates/core/src/bm25.rs
+++ replace * with / in Bm25::score
@@ -69,17 +69,17 @@
     ///                tf + k1 * (1 - b + b * len/avg)
     /// ```
     pub fn score(&self, tf: u32, doc_len: u32, avg_doc_len: f32, idf: f32) -> f32 {
         if tf == 0 || avg_doc_len <= 0.0 {
             return 0.0;
         }
         let tf = tf as f32;
         let norm = 1.0 - self.b + self.b * (doc_len as f32 / avg_doc_len);
-        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 * norm)
+        idf * (tf * (self.k1 + 1.0)) / (tf + self.k1 / /* ~ changed by cargo-mutants ~ */ norm)
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const AVG: f32 = 100.0;

---- bm25::tests::short_documents_outrank_long_ones_for_the_same_match stdout ----

thread 'bm25::tests::short_documents_outrank_long_ones_for_the_same_match' (12822277) panicked at crates/core/src/bm25.rs:122:9:
assertion failed: short > long

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12822435) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term0` limit 1: different ranking
  left: 0
 right: 32

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12822438) panicked at crates/core/src/searcher.rs:632:13:
assertion `left == right` failed: k1=0.5 b=1 changed the ranking
  left: [32, 64, 0, 16, 48, 192, 112, 224, 144, 784]
 right: [32, 64, 0, 16, 48, 512, 192, 352, 672, 112]

failures:
    bm25::tests::short_documents_outrank_long_ones_for_the_same_match
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 135 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
