*** crates/core/src/codec.rs:103:18: replace += with -= in decode_plain

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace += with -= in decode_plain
@@ -95,17 +95,17 @@
 pub fn decode_plain(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     for _ in 0..count {
         if consumed >= bytes.len() {
             break;
         }
         let (value, used) = read_varint(&bytes[consumed..]);
-        consumed += used;
+        consumed -= /* ~ changed by cargo-mutants ~ */ used;
         values.push(value);
     }
     (values, consumed)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12858827) panicked at crates/core/src/codec.rs:103:9:
attempt to subtract with overflow

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12858839) panicked at crates/core/src/codec.rs:103:9:
attempt to subtract with overflow

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12858834) panicked at crates/core/src/codec.rs:103:9:
attempt to subtract with overflow

failures:
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::both_formats_return_the_same_results

test result: FAILED. 91 passed; 47 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.69s

*** result: Failure(101)
