*** crates/core/src/codec.rs:103:18: replace += with *= in decode_plain

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace += with *= in decode_plain
@@ -95,17 +95,17 @@
 pub fn decode_plain(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     for _ in 0..count {
         if consumed >= bytes.len() {
             break;
         }
         let (value, used) = read_varint(&bytes[consumed..]);
-        consumed += used;
+        consumed *= /* ~ changed by cargo-mutants ~ */ used;
         values.push(value);
     }
     (values, consumed)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12859021) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 9, 9, 9, 9]
 right: [9, 1, 300, 0, 7]

---- index::tests::compressed_postings_decode_back_to_what_was_indexed stdout ----

thread 'index::tests::compressed_postings_decode_back_to_what_was_indexed' (12859048) panicked at crates/core/src/index.rs:671:9:
assertion `left == right` failed
  left: [2, 3]
 right: [0, 3]

---- index::tests::postings_record_every_position stdout ----

thread 'index::tests::postings_record_every_position' (12859057) panicked at crates/core/src/index.rs:641:9:
assertion `left == right` failed
  left: [2, 2]
 right: [0, 3]

failures:
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    index::tests::compressed_postings_decode_back_to_what_was_indexed
    index::tests::postings_record_every_position
    searcher::tests::phrases_require_adjacency_in_the_right_order

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
