*** crates/core/src/codec.rs:30:5: replace write_varint with ()

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace write_varint with ()
@@ -22,21 +22,17 @@
 //!
 //! assert!(bytes.len() < docs.len() * 4, "compression should pay off");
 //! assert_eq!(decode_sorted(&bytes, docs.len()).0, docs);
 //! ```
 
 /// Appends `value` to `out` in LEB128: seven bits per byte, high bit set on
 /// every byte but the last.
 pub fn write_varint(mut value: u32, out: &mut Vec<u8>) {
-    while value >= 0x80 {
-        out.push((value as u8) | 0x80);
-        value >>= 7;
-    }
-    out.push(value as u8);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads one varint from `bytes`, returning it and how many bytes it used.
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12824239) panicked at crates/core/src/codec.rs:126:13:
assertion `left == right` failed: value 1
  left: (0, 0)
 right: (1, 0)

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12824231) panicked at crates/core/src/codec.rs:176:9:
assertion `left == right` failed
  left: []
 right: [4294967295]

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12824233) panicked at crates/core/src/codec.rs:209:9:
assertion `left == right` failed
  left: []
 right: [5, 10]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::varint_length_grows_with_magnitude
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead

test result: FAILED. 101 passed; 37 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
