*** crates/core/src/codec.rs:31:32: replace | with & in write_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace | with & in write_varint
@@ -23,17 +23,17 @@
 //! assert!(bytes.len() < docs.len() * 4, "compression should pay off");
 //! assert_eq!(decode_sorted(&bytes, docs.len()).0, docs);
 //! ```
 
 /// Appends `value` to `out` in LEB128: seven bits per byte, high bit set on
 /// every byte but the last.
 pub fn write_varint(mut value: u32, out: &mut Vec<u8>) {
     while value >= 0x80 {
-        out.push((value as u8) | 0x80);
+        out.push((value as u8) & /* ~ changed by cargo-mutants ~ */ 0x80);
         value >>= 7;
     }
     out.push(value as u8);
 }
 
 /// Reads one varint from `bytes`, returning it and how many bytes it used.
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12825005) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 255
  left: (128, 2)
 right: (255, 2)

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12824997) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [4026531840]
 right: [4294967295]

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12825001) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 1, 0, 2, 0]
 right: [9, 1, 300, 0, 7]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 130 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
