*** crates/core/src/codec.rs:31:32: replace | with ^ in write_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace | with ^ in write_varint
@@ -23,17 +23,17 @@
 //! assert!(bytes.len() < docs.len() * 4, "compression should pay off");
 //! assert_eq!(decode_sorted(&bytes, docs.len()).0, docs);
 //! ```
 
 /// Appends `value` to `out` in LEB128: seven bits per byte, high bit set on
 /// every byte but the last.
 pub fn write_varint(mut value: u32, out: &mut Vec<u8>) {
     while value >= 0x80 {
-        out.push((value as u8) | 0x80);
+        out.push((value as u8) ^ /* ~ changed by cargo-mutants ~ */ 0x80);
         value >>= 7;
     }
     out.push(value as u8);
 }
 
 /// Reads one varint from `bytes`, returning it and how many bytes it used.
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12825596) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [127]
 right: [4294967295]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12825604) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 128
  left: (0, 1)
 right: (128, 2)

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12825605) panicked at crates/core/src/cursor.rs:352:9:
assertion failed: cursor.block_upper_bound() > 0.0

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 130 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
