*** crates/core/src/codec.rs:32:15: replace >>= with <<= in write_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace >>= with <<= in write_varint
@@ -24,17 +24,17 @@
 //! assert_eq!(decode_sorted(&bytes, docs.len()).0, docs);
 //! ```
 
 /// Appends `value` to `out` in LEB128: seven bits per byte, high bit set on
 /// every byte but the last.
 pub fn write_varint(mut value: u32, out: &mut Vec<u8>) {
     while value >= 0x80 {
         out.push((value as u8) | 0x80);
-        value >>= 7;
+        value <<= /* ~ changed by cargo-mutants ~ */ 7;
     }
     out.push(value as u8);
 }
 
 /// Reads one varint from `bytes`, returning it and how many bytes it used.
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12826657) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [0]
 right: [4294967295]

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12826661) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 1, 0]
 right: [9, 1, 300, 0, 7]

---- codec::tests::varint_length_grows_with_magnitude stdout ----

thread 'codec::tests::varint_length_grows_with_magnitude' (12826664) panicked at crates/core/src/codec.rs:143:9:
assertion `left == right` failed
  left: 5
 right: 2

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::varint_length_grows_with_magnitude
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 127 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
