*** crates/core/src/codec.rs:43:5: replace read_varint -> (u32, usize) with (0, 0)

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace read_varint -> (u32, usize) with (0, 0)
@@ -35,29 +35,17 @@
 }
 
 /// Reads one varint from `bytes`, returning it and how many bytes it used.
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
-    let mut value: u32 = 0;
-    let mut shift = 0;
-    for (idx, &byte) in bytes.iter().enumerate() {
-        value |= u32::from(byte & 0x7F) << shift;
-        if byte & 0x80 == 0 {
-            return (value, idx + 1);
-        }
-        shift += 7;
-        if shift >= 35 {
-            break;
-        }
-    }
-    (0, bytes.len())
+    (0, 0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.
 ///
 /// The first value is written as is; every later one as its distance from its
 /// predecessor.
 pub fn encode_sorted(values: &[u32], out: &mut Vec<u8>) {
     let mut previous = 0u32;

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12827613) panicked at crates/core/src/codec.rs:118:13:
assertion `left == right` failed: value 0
  left: (0, 0)
 right: (0, 1)

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12827609) panicked at crates/core/src/codec.rs:176:9:
assertion `left == right` failed
  left: [0, 0, 0, 0, 0]
 right: [9, 1, 300, 0, 7]

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12827610) panicked at crates/core/src/codec.rs:141:9:
assertion `left == right` failed

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::an_unterminated_varint_does_not_read_past_the_slice
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries

test result: FAILED. 108 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
