*** crates/core/src/codec.rs:46:33: replace & with | in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace & with | in read_varint
@@ -38,17 +38,17 @@
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
-        value |= u32::from(byte & 0x7F) << shift;
+        value |= u32::from(byte | /* ~ changed by cargo-mutants ~ */ 0x7F) << shift;
         if byte & 0x80 == 0 {
             return (value, idx + 1);
         }
         shift += 7;
         if shift >= 35 {
             break;
         }
     }

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12832778) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [127, 127, 16383, 127, 127]
 right: [9, 1, 300, 0, 7]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12832782) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 0
  left: (127, 1)
 right: (0, 1)

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12832779) panicked at crates/core/src/codec.rs:153:9:
assertion `left == right` failed

failures:
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets

test result: FAILED. 105 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
