*** crates/core/src/codec.rs:46:33: replace & with ^ in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace & with ^ in read_varint
@@ -38,17 +38,17 @@
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
-        value |= u32::from(byte & 0x7F) << shift;
+        value |= u32::from(byte ^ /* ~ changed by cargo-mutants ~ */ 0x7F) << shift;
         if byte & 0x80 == 0 {
             return (value, idx + 1);
         }
         shift += 7;
         if shift >= 35 {
             break;
         }
     }

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12833414) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [270549120]
 right: [4294967295]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12833422) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 0
  left: (127, 1)
 right: (0, 1)

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12833416) panicked at crates/core/src/codec.rs:213:9:
assertion `left == right` failed
  left: [122, 244]
 right: [5, 10]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index

test result: FAILED. 104 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
