*** crates/core/src/codec.rs:46:41: replace << with >> in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace << with >> in read_varint
@@ -38,17 +38,17 @@
 ///
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
-        value |= u32::from(byte & 0x7F) << shift;
+        value |= u32::from(byte & 0x7F) >> /* ~ changed by cargo-mutants ~ */ shift;
         if byte & 0x80 == 0 {
             return (value, idx + 1);
         }
         shift += 7;
         if shift >= 35 {
             break;
         }
     }

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12831927) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [127]
 right: [4294967295]

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12831931) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 1, 44, 0, 7]
 right: [9, 1, 300, 0, 7]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12831935) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 128
  left: (0, 2)
 right: (128, 2)

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 128 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
