*** crates/core/src/codec.rs:47:24: replace == with != in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace == with != in read_varint
@@ -39,17 +39,17 @@
 /// A truncated or over-long sequence yields `(0, bytes.len())`: the decoder
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
         value |= u32::from(byte & 0x7F) << shift;
-        if byte & 0x80 == 0 {
+        if byte & 0x80 != /* ~ changed by cargo-mutants ~ */ 0 {
             return (value, idx + 1);
         }
         shift += 7;
         if shift >= 35 {
             break;
         }
     }
     (0, bytes.len())

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12834561) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 1
  left: (0, 1)
 right: (1, 1)

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12834557) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [721033, 0]
 right: [9, 1, 300, 0, 7]

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12834555) panicked at crates/core/src/codec.rs:213:9:
assertion `left == right` failed
  left: [0]
 right: [5, 10]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::an_unterminated_varint_does_not_read_past_the_slice
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead

test result: FAILED. 101 passed; 37 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
