*** crates/core/src/codec.rs:48:32: replace + with - in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace + with - in read_varint
@@ -40,17 +40,17 @@
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
         value |= u32::from(byte & 0x7F) << shift;
         if byte & 0x80 == 0 {
-            return (value, idx + 1);
+            return (value, idx - /* ~ changed by cargo-mutants ~ */ 1);
         }
         shift += 7;
         if shift >= 35 {
             break;
         }
     }
     (0, bytes.len())
 }

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12837151) panicked at crates/core/src/codec.rs:48:28:
attempt to subtract with overflow

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12837148) panicked at crates/core/src/codec.rs:48:28:
attempt to subtract with overflow

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12837147) panicked at crates/core/src/codec.rs:48:28:
attempt to subtract with overflow

failures:
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::truncated_input_stops_instead_of_looping_or_panicking
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead

test result: FAILED. 87 passed; 51 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
