*** crates/core/src/codec.rs:48:32: replace + with * in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace + with * in read_varint
@@ -40,17 +40,17 @@
 /// never reads past the slice and never loops forever on malformed input, which
 /// matters because these bytes come from a file on disk.
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
         value |= u32::from(byte & 0x7F) << shift;
         if byte & 0x80 == 0 {
-            return (value, idx + 1);
+            return (value, idx * /* ~ changed by cargo-mutants ~ */ 1);
         }
         shift += 7;
         if shift >= 35 {
             break;
         }
     }
     (0, bytes.len())
 }

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12837953) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 9, 9, 9, 9]
 right: [9, 1, 300, 0, 7]

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12837951) panicked at crates/core/src/codec.rs:213:9:
assertion `left == right` failed
  left: [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
 right: [5, 10]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12837957) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 0
  left: (0, 0)
 right: (0, 1)

failures:
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::sorted_sequences_round_trip
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::search_returns_titles_scores_and_snippets
    index::tests::compressed_postings_decode_back_to_what_was_indexed
    index::tests::merge_renumbers_documents_and_keeps_postings_aligned
    index::tests::postings_record_every_position
    index::tests::reopening_a_sealed_index_keeps_the_earlier_postings

test result: FAILED. 116 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
