*** crates/core/src/codec.rs:50:15: replace += with -= in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace += with -= in read_varint
@@ -42,17 +42,17 @@
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
         value |= u32::from(byte & 0x7F) << shift;
         if byte & 0x80 == 0 {
             return (value, idx + 1);
         }
-        shift += 7;
+        shift -= /* ~ changed by cargo-mutants ~ */ 7;
         if shift >= 35 {
             break;
         }
     }
     (0, bytes.len())
 }
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12838651) panicked at crates/core/src/codec.rs:46:18:
attempt to shift left with overflow

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12838647) panicked at crates/core/src/codec.rs:46:18:
attempt to shift left with overflow

---- codec::tests::an_unterminated_varint_does_not_read_past_the_slice stdout ----

thread 'codec::tests::an_unterminated_varint_does_not_read_past_the_slice' (12838648) panicked at crates/core/src/codec.rs:46:18:
attempt to shift left with overflow

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::an_unterminated_varint_does_not_read_past_the_slice
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    index::tests::posting_lists_are_split_into_blocks
    searcher::tests::a_smaller_limit_prunes_more

test result: FAILED. 121 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
