*** crates/core/src/codec.rs:50:15: replace += with *= in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace += with *= in read_varint
@@ -42,17 +42,17 @@
 pub fn read_varint(bytes: &[u8]) -> (u32, usize) {
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
         value |= u32::from(byte & 0x7F) << shift;
         if byte & 0x80 == 0 {
             return (value, idx + 1);
         }
-        shift += 7;
+        shift *= /* ~ changed by cargo-mutants ~ */ 7;
         if shift >= 35 {
             break;
         }
     }
     (0, bytes.len())
 }
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12839930) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 1, 46, 0, 7]
 right: [9, 1, 300, 0, 7]

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12839926) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [127]
 right: [4294967295]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12839934) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 128
  left: (1, 2)
 right: (128, 2)

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 127 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
