*** crates/core/src/codec.rs:51:18: replace >= with < in read_varint

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace >= with < in read_varint
@@ -43,17 +43,17 @@
     let mut value: u32 = 0;
     let mut shift = 0;
     for (idx, &byte) in bytes.iter().enumerate() {
         value |= u32::from(byte & 0x7F) << shift;
         if byte & 0x80 == 0 {
             return (value, idx + 1);
         }
         shift += 7;
-        if shift >= 35 {
+        if shift < /* ~ changed by cargo-mutants ~ */ 35 {
             break;
         }
     }
     (0, bytes.len())
 }
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.
 ///

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12840519) panicked at crates/core/src/codec.rs:188:9:
assertion `left == right` failed
  left: [9, 1, 0]
 right: [9, 1, 300, 0, 7]

---- codec::tests::varints_round_trip_across_every_size_boundary stdout ----

thread 'codec::tests::varints_round_trip_across_every_size_boundary' (12840523) panicked at crates/core/src/codec.rs:130:13:
assertion `left == right` failed: value 128
  left: (0, 2)
 right: (128, 2)

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12840515) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: [0]
 right: [4294967295]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    codec::tests::varints_round_trip_across_every_size_boundary
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    index::tests::posting_lists_are_split_into_blocks
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking

test result: FAILED. 125 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
