*** crates/core/src/codec.rs:63:5: replace encode_sorted with ()

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace encode_sorted with ()
@@ -55,21 +55,17 @@
     (0, bytes.len())
 }
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.
 ///
 /// The first value is written as is; every later one as its distance from its
 /// predecessor.
 pub fn encode_sorted(values: &[u32], out: &mut Vec<u8>) {
-    let mut previous = 0u32;
-    for &value in values {
-        write_varint(value - previous, out);
-        previous = value;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes `count` delta encoded values, returning them and the bytes consumed.
 pub fn decode_sorted(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     let mut previous = 0u32;
     for _ in 0..count {

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12840822) panicked at crates/core/src/codec.rs:149:9:
assertion `left == right` failed
  left: []

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12840817) panicked at crates/core/src/codec.rs:176:9:
assertion `left == right` failed
  left: []
 right: [4294967295]

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12840819) panicked at crates/core/src/codec.rs:209:9:
assertion `left == right` failed
  left: []
 right: [5, 10]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::sorted_sequences_round_trip
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::both_formats_return_the_same_results

test result: FAILED. 102 passed; 36 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
