*** crates/core/src/codec.rs:65:28: replace - with + in encode_sorted

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace - with + in encode_sorted
@@ -57,17 +57,17 @@
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.
 ///
 /// The first value is written as is; every later one as its distance from its
 /// predecessor.
 pub fn encode_sorted(values: &[u32], out: &mut Vec<u8>) {
     let mut previous = 0u32;
     for &value in values {
-        write_varint(value - previous, out);
+        write_varint(value + /* ~ changed by cargo-mutants ~ */ previous, out);
         previous = value;
     }
 }
 
 /// Decodes `count` delta encoded values, returning them and the bytes consumed.
 pub fn decode_sorted(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12842586) panicked at crates/core/src/codec.rs:213:9:
assertion `left == right` failed
  left: [5, 20]
 right: [5, 10]

---- codec::tests::delta_encoding_beats_fixed_width_on_dense_lists stdout ----

thread 'codec::tests::delta_encoding_beats_fixed_width_on_dense_lists' (12842587) panicked at crates/core/src/codec.rs:164:9:
expected strong compression, got 3000 bytes for 1000 values

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12842589) panicked at crates/core/src/codec.rs:153:9:
assertion `left == right` failed

failures:
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::delta_encoding_beats_fixed_width_on_dense_lists
    codec::tests::sorted_sequences_round_trip
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::excluded_terms_are_removed_from_the_results
    searcher::tests::phrases_require_adjacency_in_the_right_order
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking

test result: FAILED. 123 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
