*** crates/core/src/codec.rs:65:28: replace - with / in encode_sorted

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace - with / in encode_sorted
@@ -57,17 +57,17 @@
 
 /// Encodes a strictly increasing sequence as deltas, appending to `out`.
 ///
 /// The first value is written as is; every later one as its distance from its
 /// predecessor.
 pub fn encode_sorted(values: &[u32], out: &mut Vec<u8>) {
     let mut previous = 0u32;
     for &value in values {
-        write_varint(value - previous, out);
+        write_varint(value / /* ~ changed by cargo-mutants ~ */ previous, out);
         previous = value;
     }
 }
 
 /// Decodes `count` delta encoded values, returning them and the bytes consumed.
 pub fn decode_sorted(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12843110) panicked at crates/core/src/codec.rs:65:22:
attempt to divide by zero

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12843112) panicked at crates/core/src/codec.rs:65:22:
attempt to divide by zero

---- codec::tests::delta_encoding_beats_fixed_width_on_dense_lists stdout ----

thread 'codec::tests::delta_encoding_beats_fixed_width_on_dense_lists' (12843113) panicked at crates/core/src/codec.rs:65:22:
attempt to divide by zero

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::delta_encoding_beats_fixed_width_on_dense_lists
    codec::tests::sorted_sequences_round_trip
    codec::tests::truncated_input_stops_instead_of_looping_or_panicking
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead

test result: FAILED. 61 passed; 77 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
