*** crates/core/src/codec.rs:72:5: replace decode_sorted -> (Vec<u32>, usize) with (vec![0], 0)

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace decode_sorted -> (Vec<u32>, usize) with (vec![0], 0)
@@ -64,29 +64,17 @@
     for &value in values {
         write_varint(value - previous, out);
         previous = value;
     }
 }
 
 /// Decodes `count` delta encoded values, returning them and the bytes consumed.
 pub fn decode_sorted(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
-    let mut values = Vec::with_capacity(count);
-    let mut consumed = 0;
-    let mut previous = 0u32;
-    for _ in 0..count {
-        if consumed >= bytes.len() {
-            break;
-        }
-        let (delta, used) = read_varint(&bytes[consumed..]);
-        consumed += used;
-        previous = previous.saturating_add(delta);
-        values.push(previous);
-    }
-    (values, consumed)
+    (vec![0], 0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Encodes values that are not necessarily sorted, one varint each.
 pub fn encode_plain(values: &[u32], out: &mut Vec<u8>) {
     for &value in values {
         write_varint(value, out);
     }
 }

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12845386) panicked at crates/core/src/codec.rs:165:9:
assertion `left == right` failed
  left: [0]
 right: []

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12845391) panicked at crates/core/src/codec.rs:141:9:
assertion `left == right` failed
  left: [0]

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12845388) panicked at crates/core/src/codec.rs:201:9:
assertion `left == right` failed
  left: [0]
 right: [5, 10]

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::sorted_sequences_round_trip
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    engine::tests::a_shared_term_ranks_both_documents
    index::tests::compressed_postings_decode_back_to_what_was_indexed
    index::tests::merge_renumbers_documents_and_keeps_postings_aligned

test result: FAILED. 106 passed; 32 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
