*** crates/core/src/codec.rs:76:21: replace >= with < in decode_sorted

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace >= with < in decode_sorted
@@ -68,17 +68,17 @@
 }
 
 /// Decodes `count` delta encoded values, returning them and the bytes consumed.
 pub fn decode_sorted(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     let mut previous = 0u32;
     for _ in 0..count {
-        if consumed >= bytes.len() {
+        if consumed < /* ~ changed by cargo-mutants ~ */ bytes.len() {
             break;
         }
         let (delta, used) = read_varint(&bytes[consumed..]);
         consumed += used;
         previous = previous.saturating_add(delta);
         values.push(previous);
     }
     (values, consumed)

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12848761) panicked at crates/core/src/codec.rs:180:9:
assertion `left == right` failed
  left: []
 right: [4294967295]

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12848763) panicked at crates/core/src/codec.rs:213:9:
assertion `left == right` failed
  left: []
 right: [5, 10]

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12848766) panicked at crates/core/src/codec.rs:153:9:
assertion `left == right` failed
  left: []

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::sorted_sequences_round_trip
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets

test result: FAILED. 103 passed; 35 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
