*** crates/core/src/codec.rs:80:18: replace += with -= in decode_sorted

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace += with -= in decode_sorted
@@ -72,17 +72,17 @@
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     let mut previous = 0u32;
     for _ in 0..count {
         if consumed >= bytes.len() {
             break;
         }
         let (delta, used) = read_varint(&bytes[consumed..]);
-        consumed += used;
+        consumed -= /* ~ changed by cargo-mutants ~ */ used;
         previous = previous.saturating_add(delta);
         values.push(previous);
     }
     (values, consumed)
 }
 
 /// Encodes values that are not necessarily sorted, one varint each.
 pub fn encode_plain(values: &[u32], out: &mut Vec<u8>) {

---- codec::tests::a_single_value_and_an_empty_slice_are_handled stdout ----

thread 'codec::tests::a_single_value_and_an_empty_slice_are_handled' (12850500) panicked at crates/core/src/codec.rs:80:9:
attempt to subtract with overflow

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12850502) panicked at crates/core/src/codec.rs:80:9:
attempt to subtract with overflow

---- codec::tests::truncated_input_stops_instead_of_looping_or_panicking stdout ----

thread 'codec::tests::truncated_input_stops_instead_of_looping_or_panicking' (12850506) panicked at crates/core/src/codec.rs:80:9:
attempt to subtract with overflow

failures:
    codec::tests::a_single_value_and_an_empty_slice_are_handled
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::sorted_sequences_round_trip
    codec::tests::truncated_input_stops_instead_of_looping_or_panicking
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    cursor::tests::skipping_past_the_end_exhausts_the_cursor

test result: FAILED. 88 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
