*** crates/core/src/codec.rs:80:18: replace += with *= in decode_sorted

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace += with *= in decode_sorted
@@ -72,17 +72,17 @@
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     let mut previous = 0u32;
     for _ in 0..count {
         if consumed >= bytes.len() {
             break;
         }
         let (delta, used) = read_varint(&bytes[consumed..]);
-        consumed += used;
+        consumed *= /* ~ changed by cargo-mutants ~ */ used;
         previous = previous.saturating_add(delta);
         values.push(previous);
     }
     (values, consumed)
 }
 
 /// Encodes values that are not necessarily sorted, one varint each.
 pub fn encode_plain(values: &[u32], out: &mut Vec<u8>) {

---- codec::tests::decoding_more_values_than_encoded_returns_what_exists stdout ----

thread 'codec::tests::decoding_more_values_than_encoded_returns_what_exists' (12851004) panicked at crates/core/src/codec.rs:213:9:
assertion `left == right` failed
  left: [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
 right: [5, 10]

---- codec::tests::sorted_sequences_round_trip stdout ----

thread 'codec::tests::sorted_sequences_round_trip' (12851007) panicked at crates/core/src/codec.rs:153:9:
assertion `left == right` failed

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12851013) panicked at crates/core/src/cursor.rs:256:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    codec::tests::decoding_more_values_than_encoded_returns_what_exists
    codec::tests::sorted_sequences_round_trip
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::search_returns_titles_scores_and_snippets
    index::tests::compressed_postings_decode_back_to_what_was_indexed
    index::tests::merge_renumbers_documents_and_keeps_postings_aligned
    index::tests::postings_record_every_position
    index::tests::reopening_a_sealed_index_keeps_the_earlier_postings

test result: FAILED. 115 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
