*** crates/core/src/codec.rs:89:5: replace encode_plain with ()

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace encode_plain with ()
@@ -81,19 +81,17 @@
         previous = previous.saturating_add(delta);
         values.push(previous);
     }
     (values, consumed)
 }
 
 /// Encodes values that are not necessarily sorted, one varint each.
 pub fn encode_plain(values: &[u32], out: &mut Vec<u8>) {
-    for &value in values {
-        write_varint(value, out);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes `count` plain varints, returning them and the bytes consumed.
 pub fn decode_plain(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
     let mut values = Vec::with_capacity(count);
     let mut consumed = 0;
     for _ in 0..count {
         if consumed >= bytes.len() {

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12851246) panicked at crates/core/src/codec.rs:186:9:
assertion `left == right` failed
  left: []
 right: [9, 1, 300, 0, 7]

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12851253) panicked at crates/core/src/cursor.rs:256:9:
assertion `left == right` failed
  left: 0
 right: 1

---- index::tests::compressed_postings_decode_back_to_what_was_indexed stdout ----

thread 'index::tests::compressed_postings_decode_back_to_what_was_indexed' (12851273) panicked at crates/core/src/index.rs:671:9:
assertion `left == right` failed
  left: []
 right: [0, 3]

failures:
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    cursor::tests::a_new_cursor_points_at_the_first_document
    engine::tests::both_formats_return_the_same_results
    engine::tests::search_returns_titles_scores_and_snippets
    index::tests::compressed_postings_decode_back_to_what_was_indexed
    index::tests::postings_record_every_position
    index::tests::reopening_a_sealed_index_keeps_the_earlier_postings
    mmap::tests::posting_lists_decode_to_the_same_values
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::phrases_require_adjacency_in_the_right_order
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking

test result: FAILED. 124 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.83s

*** result: Failure(101)
