*** crates/core/src/codec.rs:96:5: replace decode_plain -> (Vec<u32>, usize) with (vec![0], 0)

*** mutation diff:
--- crates/core/src/codec.rs
+++ replace decode_plain -> (Vec<u32>, usize) with (vec![0], 0)
@@ -88,27 +88,17 @@
 pub fn encode_plain(values: &[u32], out: &mut Vec<u8>) {
     for &value in values {
         write_varint(value, out);
     }
 }
 
 /// Decodes `count` plain varints, returning them and the bytes consumed.
 pub fn decode_plain(bytes: &[u8], count: usize) -> (Vec<u32>, usize) {
-    let mut values = Vec::with_capacity(count);
-    let mut consumed = 0;
-    for _ in 0..count {
-        if consumed >= bytes.len() {
-            break;
-        }
-        let (value, used) = read_varint(&bytes[consumed..]);
-        consumed += used;
-        values.push(value);
-    }
-    (values, consumed)
+    (vec![0], 0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn varints_round_trip_across_every_size_boundary() {

---- codec::tests::plain_values_round_trip_without_the_sorted_assumption stdout ----

thread 'codec::tests::plain_values_round_trip_without_the_sorted_assumption' (12853839) panicked at crates/core/src/codec.rs:178:9:
assertion `left == right` failed
  left: [0]
 right: [9, 1, 300, 0, 7]

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12853846) panicked at crates/core/src/cursor.rs:256:9:
assertion `left == right` failed
  left: 0
 right: 1

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12853848) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: None
 right: Some(200)

failures:
    codec::tests::plain_values_round_trip_without_the_sorted_assumption
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::search_returns_titles_scores_and_snippets
    index::tests::compressed_postings_decode_back_to_what_was_indexed
    index::tests::merge_renumbers_documents_and_keeps_postings_aligned
    index::tests::posting_lists_are_split_into_blocks
    index::tests::postings_record_every_position

test result: FAILED. 109 passed; 29 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
