*** crates/core/src/cursor.rs:100:9: replace BlockCursor<'a>::block_upper_bound -> f32 with 0.0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_upper_bound -> f32 with 0.0
@@ -92,20 +92,17 @@
 
     /// Highest score this term can contribute to a document *in the current
     /// block*.
     ///
     /// Tighter than the term-wide bound, because a block covers a narrow slice
     /// of the collection — which is exactly what makes block-max pruning skip
     /// more than plain WAND.
     pub fn block_upper_bound(&self) -> f32 {
-        self.term.blocks().get(self.block).map_or(0.0, |meta| {
-            self.bm25
-                .score(meta.max_tf, meta.min_len, self.avg_doc_len, self.idf)
-        })
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// First block at or after the current one that can contain `doc`.
     ///
     /// Walks block metadata only — no decoding — which is what lets the pruning
     /// loop ask about a document the cursor has not reached yet.
     fn block_covering(&self, doc: DocId) -> Option<usize> {
         let blocks = self.term.blocks();

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12873978) panicked at crates/core/src/cursor.rs:349:9:
assertion failed: cursor.block_upper_bound() > 0.0

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.99s

*** result: Failure(101)
