*** crates/core/src/cursor.rs:111:9: replace BlockCursor<'a>::block_covering -> Option<usize> with None

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_covering -> Option<usize> with None
@@ -103,18 +103,17 @@
         })
     }
 
     /// First block at or after the current one that can contain `doc`.
     ///
     /// Walks block metadata only — no decoding — which is what lets the pruning
     /// loop ask about a document the cursor has not reached yet.
     fn block_covering(&self, doc: DocId) -> Option<usize> {
-        let blocks = self.term.blocks();
-        (self.block..blocks.len()).find(|&idx| blocks[idx].last_doc >= doc)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Bound on this term's contribution to `doc`, taken from the block that
     /// would contain it.
     ///
     /// Summing the *current* block's bound instead would be wrong whenever a
     /// cursor still sits behind `doc`: the document lives in a later block,
     /// whose bound may be higher, and the pruning decision would rest on an

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12876769) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12876770) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- searcher::tests::limit_truncates_the_ranking stdout ----

thread 'searcher::tests::limit_truncates_the_ranking' (12876837) panicked at crates/core/src/searcher.rs:523:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_new_service_serves_generation_one

test result: FAILED. 122 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.95s

*** result: Failure(101)
