*** crates/core/src/cursor.rs:111:9: replace BlockCursor<'a>::block_covering -> Option<usize> with Some(1)

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_covering -> Option<usize> with Some(1)
@@ -103,18 +103,17 @@
         })
     }
 
     /// First block at or after the current one that can contain `doc`.
     ///
     /// Walks block metadata only — no decoding — which is what lets the pruning
     /// loop ask about a document the cursor has not reached yet.
     fn block_covering(&self, doc: DocId) -> Option<usize> {
-        let blocks = self.term.blocks();
-        (self.block..blocks.len()).find(|&idx| blocks[idx].last_doc >= doc)
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Bound on this term's contribution to `doc`, taken from the block that
     /// would contain it.
     ///
     /// Summing the *current* block's bound instead would be wrong whenever a
     /// cursor still sits behind `doc`: the document lives in a later block,
     /// whose bound may be higher, and the pruning decision would rest on an

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12878499) panicked at crates/core/src/cursor.rs:124:29:
index out of bounds: the len is 1 but the index is 1

---- engine::tests::search_reports_the_strategy_it_used stdout ----

thread 'engine::tests::search_reports_the_strategy_it_used' (12878546) panicked at crates/core/src/cursor.rs:124:29:
index out of bounds: the len is 1 but the index is 1

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12878547) panicked at crates/core/src/cursor.rs:124:29:
index out of bounds: the len is 1 but the index is 1

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::both_formats_return_the_same_results
    engine::tests::search_reports_the_strategy_it_used
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 118 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.87s

*** result: Failure(101)
