*** crates/core/src/cursor.rs:123:9: replace BlockCursor<'a>::block_upper_bound_at -> f32 with 1.0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_upper_bound_at -> f32 with 1.0
@@ -115,25 +115,17 @@
     /// Bound on this term's contribution to `doc`, taken from the block that
     /// would contain it.
     ///
     /// Summing the *current* block's bound instead would be wrong whenever a
     /// cursor still sits behind `doc`: the document lives in a later block,
     /// whose bound may be higher, and the pruning decision would rest on an
     /// underestimate.
     pub fn block_upper_bound_at(&self, doc: DocId) -> f32 {
-        match self.block_covering(doc) {
-            Some(idx) => {
-                let meta = &self.term.blocks()[idx];
-                self.bm25
-                    .score(meta.max_tf, meta.min_len, self.avg_doc_len, self.idf)
-            }
-            // The term has nothing left at or after `doc`.
-            None => 0.0,
-        }
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Last document of the block that would contain `doc`.
     pub fn block_last_doc_at(&self, doc: DocId) -> Option<DocId> {
         self.block_covering(doc)
             .map(|idx| self.term.blocks()[idx].last_doc)
     }

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12881990) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12881954) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term3 term7` limit 3: different ranking
  left: 8
 right: 128

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12881956) panicked at crates/core/src/searcher.rs:632:13:
assertion `left == right` failed: k1=2 b=0.3 changed the ranking
  left: [48, 16, 0, 64, 32, 80, 128, 96, 144, 112]
 right: [48, 16, 0, 64, 32, 80, 240, 400, 560, 720]

failures:
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 135 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.87s

*** result: Failure(101)
