*** crates/core/src/cursor.rs:123:9: replace BlockCursor<'a>::block_upper_bound_at -> f32 with -1.0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_upper_bound_at -> f32 with -1.0
@@ -115,25 +115,17 @@
     /// Bound on this term's contribution to `doc`, taken from the block that
     /// would contain it.
     ///
     /// Summing the *current* block's bound instead would be wrong whenever a
     /// cursor still sits behind `doc`: the document lives in a later block,
     /// whose bound may be higher, and the pruning decision would rest on an
     /// underestimate.
     pub fn block_upper_bound_at(&self, doc: DocId) -> f32 {
-        match self.block_covering(doc) {
-            Some(idx) => {
-                let meta = &self.term.blocks()[idx];
-                self.bm25
-                    .score(meta.max_tf, meta.min_len, self.avg_doc_len, self.idf)
-            }
-            // The term has nothing left at or after `doc`.
-            None => 0.0,
-        }
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Last document of the block that would contain `doc`.
     pub fn block_last_doc_at(&self, doc: DocId) -> Option<DocId> {
         self.block_covering(doc)
             .map(|idx| self.term.blocks()[idx].last_doc)
     }

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12882082) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12882083) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12882109) panicked at crates/core/src/engine.rs:426:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_new_service_serves_generation_one

test result: FAILED. 122 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.84s

*** result: Failure(101)
