*** crates/core/src/cursor.rs:136:9: replace BlockCursor<'a>::block_last_doc_at -> Option<DocId> with None

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_last_doc_at -> Option<DocId> with None
@@ -128,18 +128,17 @@
             }
             // The term has nothing left at or after `doc`.
             None => 0.0,
         }
     }
 
     /// Last document of the block that would contain `doc`.
     pub fn block_last_doc_at(&self, doc: DocId) -> Option<DocId> {
-        self.block_covering(doc)
-            .map(|idx| self.term.blocks()[idx].last_doc)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Index of the block the cursor is currently in.
     pub fn block_index(&self) -> usize {
         self.block
     }
 
     /// Last document id of the current block, for deciding where to skip to.

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12883395) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.81s

*** result: Failure(101)
