*** crates/core/src/cursor.rs:142:9: replace BlockCursor<'a>::block_index -> usize with 0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_index -> usize with 0
@@ -134,17 +134,17 @@
     /// Last document of the block that would contain `doc`.
     pub fn block_last_doc_at(&self, doc: DocId) -> Option<DocId> {
         self.block_covering(doc)
             .map(|idx| self.term.blocks()[idx].last_doc)
     }
 
     /// Index of the block the cursor is currently in.
     pub fn block_index(&self) -> usize {
-        self.block
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Last document id of the current block, for deciding where to skip to.
     pub fn block_last_doc(&self) -> Option<DocId> {
         self.term.blocks().get(self.block).map(|meta| meta.last_doc)
     }
 
     /// Postings left, including the current one. Used to report pruning.

---- searcher::tests::block_max_bounds_skip_whole_blocks stdout ----

thread 'searcher::tests::block_max_bounds_skip_whole_blocks' (12885028) panicked at crates/core/src/searcher.rs:704:9:
no block was skipped: SearchStats { scored: 232, candidates: 6235, pruned: 5879, blocks_skipped: 0, strategy: Wand }

failures:
    searcher::tests::block_max_bounds_skip_whole_blocks

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.89s

*** result: Failure(101)
