*** crates/core/src/cursor.rs:142:9: replace BlockCursor<'a>::block_index -> usize with 1

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_index -> usize with 1
@@ -134,17 +134,17 @@
     /// Last document of the block that would contain `doc`.
     pub fn block_last_doc_at(&self, doc: DocId) -> Option<DocId> {
         self.block_covering(doc)
             .map(|idx| self.term.blocks()[idx].last_doc)
     }
 
     /// Index of the block the cursor is currently in.
     pub fn block_index(&self) -> usize {
-        self.block
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Last document id of the current block, for deciding where to skip to.
     pub fn block_last_doc(&self) -> Option<DocId> {
         self.term.blocks().get(self.block).map(|meta| meta.last_doc)
     }
 
     /// Postings left, including the current one. Used to report pruning.

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12886414) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::block_max_bounds_skip_whole_blocks stdout ----

thread 'searcher::tests::block_max_bounds_skip_whole_blocks' (12886337) panicked at crates/core/src/searcher.rs:704:9:
no block was skipped: SearchStats { scored: 232, candidates: 6235, pruned: 5879, blocks_skipped: 0, strategy: Wand }

failures:
    searcher::tests::block_max_bounds_skip_whole_blocks
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.09s

*** result: Failure(101)
