*** crates/core/src/cursor.rs:147:9: replace BlockCursor<'a>::block_last_doc -> Option<DocId> with None

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_last_doc -> Option<DocId> with None
@@ -139,17 +139,17 @@
 
     /// Index of the block the cursor is currently in.
     pub fn block_index(&self) -> usize {
         self.block
     }
 
     /// Last document id of the current block, for deciding where to skip to.
     pub fn block_last_doc(&self) -> Option<DocId> {
-        self.term.blocks().get(self.block).map(|meta| meta.last_doc)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Postings left, including the current one. Used to report pruning.
     pub fn remaining(&self) -> usize {
         let in_block = self.decoded.len().saturating_sub(self.at);
         let later: usize = self
             .term
             .blocks()

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12886704) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: Some(128)
 right: Some(200)

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12886701) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: Some(128)
 right: Some(389)

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12886703) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 257
  left: Some(256)
 right: Some(258)

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.93s

*** result: Failure(101)
