*** crates/core/src/cursor.rs:147:9: replace BlockCursor<'a>::block_last_doc -> Option<DocId> with Some(Default::default())

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::block_last_doc -> Option<DocId> with Some(Default::default())
@@ -139,17 +139,17 @@
 
     /// Index of the block the cursor is currently in.
     pub fn block_index(&self) -> usize {
         self.block
     }
 
     /// Last document id of the current block, for deciding where to skip to.
     pub fn block_last_doc(&self) -> Option<DocId> {
-        self.term.blocks().get(self.block).map(|meta| meta.last_doc)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Postings left, including the current one. Used to report pruning.
     pub fn remaining(&self) -> usize {
         let in_block = self.decoded.len().saturating_sub(self.at);
         let later: usize = self
             .term
             .blocks()

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12887775) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 1
  left: Some(256)
 right: Some(2)

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12887907) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12887865) panicked at crates/core/src/searcher.rs:601:21:
`term0 term1` limit 1: doc 2 scored 1.3291495 vs 1.3310641

failures:
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.88s

*** result: Failure(101)
