*** crates/core/src/cursor.rs:157:30: replace + with - in BlockCursor<'a>::remaining

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with - in BlockCursor<'a>::remaining
@@ -149,17 +149,17 @@
 
     /// Postings left, including the current one. Used to report pruning.
     pub fn remaining(&self) -> usize {
         let in_block = self.decoded.len().saturating_sub(self.at);
         let later: usize = self
             .term
             .blocks()
             .iter()
-            .skip(self.block + 1)
+            .skip(self.block - /* ~ changed by cargo-mutants ~ */ 1)
             .map(|meta| meta.count as usize)
             .sum();
         in_block + later
     }
 
     /// Moves to the first document `>= target`, returning it.
     ///
     /// Never moves backwards, so calling it with a target already behind the

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12890187) panicked at crates/core/src/cursor.rs:307:9:
assertion `left == right` failed
  left: 10
 right: 0

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12890186) panicked at crates/core/src/cursor.rs:157:19:
attempt to subtract with overflow

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12890260) panicked at crates/core/src/cursor.rs:157:19:
attempt to subtract with overflow

failures:
    cursor::tests::remaining_counts_the_postings_still_ahead
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 130 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.86s

*** result: Failure(101)
