*** crates/core/src/cursor.rs:157:30: replace + with * in BlockCursor<'a>::remaining

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with * in BlockCursor<'a>::remaining
@@ -149,17 +149,17 @@
 
     /// Postings left, including the current one. Used to report pruning.
     pub fn remaining(&self) -> usize {
         let in_block = self.decoded.len().saturating_sub(self.at);
         let later: usize = self
             .term
             .blocks()
             .iter()
-            .skip(self.block + 1)
+            .skip(self.block * /* ~ changed by cargo-mutants ~ */ 1)
             .map(|meta| meta.count as usize)
             .sum();
         in_block + later
     }
 
     /// Moves to the first document `>= target`, returning it.
     ///
     /// Never moves backwards, so calling it with a target already behind the

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12891236) panicked at crates/core/src/cursor.rs:331:9:
assertion `left == right` failed
  left: 384
 right: 256

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12891420) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    cursor::tests::remaining_counts_the_postings_still_ahead
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.89s

*** result: Failure(101)
