*** crates/core/src/cursor.rs:160:18: replace + with - in BlockCursor<'a>::remaining

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with - in BlockCursor<'a>::remaining
@@ -152,17 +152,17 @@
         let in_block = self.decoded.len().saturating_sub(self.at);
         let later: usize = self
             .term
             .blocks()
             .iter()
             .skip(self.block + 1)
             .map(|meta| meta.count as usize)
             .sum();
-        in_block + later
+        in_block - /* ~ changed by cargo-mutants ~ */ later
     }
 
     /// Moves to the first document `>= target`, returning it.
     ///
     /// Never moves backwards, so calling it with a target already behind the
     /// cursor is a no-op — the pruning loop relies on that to push several
     /// cursors at the same pivot without tracking which are already there.
     pub fn advance_to(&mut self, target: DocId) -> Option<DocId> {

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12891916) panicked at crates/core/src/cursor.rs:331:9:
assertion `left == right` failed
  left: 0
 right: 256

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12891996) panicked at crates/core/src/cursor.rs:160:9:
attempt to subtract with overflow

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12891995) panicked at crates/core/src/cursor.rs:160:9:
attempt to subtract with overflow

failures:
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 131 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.86s

*** result: Failure(101)
