*** crates/core/src/cursor.rs:174:58: replace < with == in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with == in BlockCursor<'a>::advance_to
@@ -166,17 +166,17 @@
     /// cursor is a no-op — the pruning loop relies on that to push several
     /// cursors at the same pivot without tracking which are already there.
     pub fn advance_to(&mut self, target: DocId) -> Option<DocId> {
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
-        if self.block_last_doc().is_some_and(|last| last < target) {
+        if self.block_last_doc().is_some_and(|last| last == /* ~ changed by cargo-mutants ~ */ target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12896951) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: Some(128)
 right: Some(200)

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12896948) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: Some(128)
 right: Some(389)

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12896950) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 254
  left: Some(256)
 right: Some(254)

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
