*** crates/core/src/cursor.rs:174:58: replace < with <= in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with <= in BlockCursor<'a>::advance_to
@@ -166,17 +166,17 @@
     /// cursor is a no-op — the pruning loop relies on that to push several
     /// cursors at the same pivot without tracking which are already there.
     pub fn advance_to(&mut self, target: DocId) -> Option<DocId> {
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
-        if self.block_last_doc().is_some_and(|last| last < target) {
+        if self.block_last_doc().is_some_and(|last| last <= /* ~ changed by cargo-mutants ~ */ target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12898687) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 254
  left: Some(256)
 right: Some(254)

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12898764) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term1 term2 term3 term4 term5 term6 term7` limit 50: different ranking
  left: 24
 right: 496

failures:
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
