*** crates/core/src/cursor.rs:175:40: replace + with - in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with - in BlockCursor<'a>::advance_to
@@ -167,17 +167,17 @@
     /// cursors at the same pivot without tracking which are already there.
     pub fn advance_to(&mut self, target: DocId) -> Option<DocId> {
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
-            let mut block = self.block + 1;
+            let mut block = self.block - /* ~ changed by cargo-mutants ~ */ 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12900052) panicked at crates/core/src/cursor.rs:175:29:
attempt to subtract with overflow

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12900049) panicked at crates/core/src/cursor.rs:175:29:
attempt to subtract with overflow

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12900051) panicked at crates/core/src/cursor.rs:175:29:
attempt to subtract with overflow

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 125 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
