*** crates/core/src/cursor.rs:175:40: replace + with * in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with * in BlockCursor<'a>::advance_to
@@ -167,17 +167,17 @@
     /// cursors at the same pivot without tracking which are already there.
     pub fn advance_to(&mut self, target: DocId) -> Option<DocId> {
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
-            let mut block = self.block + 1;
+            let mut block = self.block * /* ~ changed by cargo-mutants ~ */ 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12901362) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
