*** crates/core/src/cursor.rs:177:25: replace < with == in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with == in BlockCursor<'a>::advance_to
@@ -169,17 +169,17 @@
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
-            while block < blocks.len() && blocks[block].last_doc < target {
+            while block == /* ~ changed by cargo-mutants ~ */ blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12903011) panicked at crates/core/src/cursor.rs:177:79:
index out of bounds: the len is 1 but the index is 1

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12903005) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: Some(256)
 right: Some(389)

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12903083) panicked at crates/core/src/cursor.rs:177:79:
index out of bounds: the len is 4 but the index is 4

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
