*** crates/core/src/cursor.rs:177:25: replace < with > in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with > in BlockCursor<'a>::advance_to
@@ -169,17 +169,17 @@
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
-            while block < blocks.len() && blocks[block].last_doc < target {
+            while block > /* ~ changed by cargo-mutants ~ */ blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12903872) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: Some(256)
 right: Some(389)

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12903985) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
