*** crates/core/src/cursor.rs:177:25: replace < with <= in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with <= in BlockCursor<'a>::advance_to
@@ -169,17 +169,17 @@
         if self.doc().is_some_and(|doc| doc >= target) {
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
-            while block < blocks.len() && blocks[block].last_doc < target {
+            while block <= /* ~ changed by cargo-mutants ~ */ blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12904748) panicked at crates/core/src/cursor.rs:177:79:
index out of bounds: the len is 1 but the index is 1

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12904744) panicked at crates/core/src/cursor.rs:177:79:
index out of bounds: the len is 2 but the index is 2

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12904847) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 133 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
