*** crates/core/src/cursor.rs:178:23: replace += with -= in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace += with -= in BlockCursor<'a>::advance_to
@@ -170,17 +170,17 @@
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
-                block += 1;
+                block -= /* ~ changed by cargo-mutants ~ */ 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12908585) panicked at crates/core/src/cursor.rs:178:17:
attempt to subtract with overflow

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12908587) panicked at crates/core/src/cursor.rs:178:17:
attempt to subtract with overflow

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12908690) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 133 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
