*** crates/core/src/cursor.rs:178:23: replace += with *= in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace += with *= in BlockCursor<'a>::advance_to
@@ -170,17 +170,17 @@
             return self.doc();
         }
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
-                block += 1;
+                block *= /* ~ changed by cargo-mutants ~ */ 1;
             }
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }

*** result: Timeout
