*** crates/core/src/cursor.rs:180:22: replace >= with < in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace >= with < in BlockCursor<'a>::advance_to
@@ -172,17 +172,17 @@
 
         // Walk the block index. Nothing here is decoded: one integer per block.
         if self.block_last_doc().is_some_and(|last| last < target) {
             let mut block = self.block + 1;
             let blocks = self.term.blocks();
             while block < blocks.len() && blocks[block].last_doc < target {
                 block += 1;
             }
-            if block >= blocks.len() {
+            if block < /* ~ changed by cargo-mutants ~ */ blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }
 
         self.at = gallop(&self.decoded, self.at, target);
         if self.at >= self.decoded.len() {

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12912361) panicked at crates/core/src/cursor.rs:352:9:
assertion failed: cursor.block_upper_bound() > 0.0

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12912362) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: None
 right: Some(389)

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12912366) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: None
 right: Some(200)

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 129 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
