*** crates/core/src/cursor.rs:188:20: replace >= with < in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace >= with < in BlockCursor<'a>::advance_to
@@ -180,17 +180,17 @@
             if block >= blocks.len() {
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }
 
         self.at = gallop(&self.decoded, self.at, target);
-        if self.at >= self.decoded.len() {
+        if self.at < /* ~ changed by cargo-mutants ~ */ self.decoded.len() {
             let next = self.block + 1;
             self.load_block(next);
         }
         self.doc()
     }
 
     /// Moves one posting forward, crossing into the next block if needed.
     pub fn advance(&mut self) -> Option<DocId> {

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12914121) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: None
 right: Some(389)

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12914124) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: None
 right: Some(200)

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12914126) panicked at crates/core/src/cursor.rs:333:9:
assertion `left == right` failed
  left: 0
 right: 128

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 130 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
