*** crates/core/src/cursor.rs:189:35: replace + with * in BlockCursor<'a>::advance_to

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with * in BlockCursor<'a>::advance_to
@@ -181,17 +181,17 @@
                 self.load_block(blocks.len());
                 return None;
             }
             self.load_block(block);
         }
 
         self.at = gallop(&self.decoded, self.at, target);
         if self.at >= self.decoded.len() {
-            let next = self.block + 1;
+            let next = self.block * /* ~ changed by cargo-mutants ~ */ 1;
             self.load_block(next);
         }
         self.doc()
     }
 
     /// Moves one posting forward, crossing into the next block if needed.
     pub fn advance(&mut self) -> Option<DocId> {
         self.at += 1;

---- service::tests::queries_keep_being_answered_while_the_index_is_rebuilt stdout ----

thread 'service::tests::queries_keep_being_answered_while_the_index_is_rebuilt' (12915962) panicked at crates/core/src/service.rs:286:9:
readers never got to run

failures:
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
