*** crates/core/src/cursor.rs:198:20: replace >= with < in BlockCursor<'a>::advance

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace >= with < in BlockCursor<'a>::advance
@@ -190,17 +190,17 @@
             self.load_block(next);
         }
         self.doc()
     }
 
     /// Moves one posting forward, crossing into the next block if needed.
     pub fn advance(&mut self) -> Option<DocId> {
         self.at += 1;
-        if self.at >= self.decoded.len() {
+        if self.at < /* ~ changed by cargo-mutants ~ */ self.decoded.len() {
             let next = self.block + 1;
             self.load_block(next);
         }
         self.doc()
     }
 }
 
 /// Index of the first posting `>= target` at or after `from`, found by

---- cursor::tests::advance_walks_every_posting_across_block_boundaries stdout ----

thread 'cursor::tests::advance_walks_every_posting_across_block_boundaries' (12921935) panicked at crates/core/src/cursor.rs:269:9:
assertion `left == right` failed
  left: 3
 right: 263

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12921939) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 1
 right: 2

---- searcher::tests::documents_matching_more_clauses_rank_higher stdout ----

thread 'searcher::tests::documents_matching_more_clauses_rank_higher' (12922003) panicked at crates/core/src/searcher.rs:489:9:
assertion `left == right` failed: d2 has both terms and must come first
  left: "d1"
 right: "d2"

failures:
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::a_shared_term_ranks_both_documents
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_snapshot_keeps_answering_from_the_generation_it_took

test result: FAILED. 123 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.98s

*** result: Failure(101)
