*** crates/core/src/cursor.rs:199:35: replace + with - in BlockCursor<'a>::advance

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with - in BlockCursor<'a>::advance
@@ -191,17 +191,17 @@
         }
         self.doc()
     }
 
     /// Moves one posting forward, crossing into the next block if needed.
     pub fn advance(&mut self) -> Option<DocId> {
         self.at += 1;
         if self.at >= self.decoded.len() {
-            let next = self.block + 1;
+            let next = self.block - /* ~ changed by cargo-mutants ~ */ 1;
             self.load_block(next);
         }
         self.doc()
     }
 }
 
 /// Index of the first posting `>= target` at or after `from`, found by
 /// exponentially widening a window and then bisecting it.

---- cursor::tests::advance_walks_every_posting_across_block_boundaries stdout ----

thread 'cursor::tests::advance_walks_every_posting_across_block_boundaries' (12922824) panicked at crates/core/src/cursor.rs:199:24:
attempt to subtract with overflow

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12922828) panicked at crates/core/src/cursor.rs:199:24:
attempt to subtract with overflow

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12922829) panicked at crates/core/src/cursor.rs:199:24:
attempt to subtract with overflow

failures:
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::both_formats_return_the_same_results
    engine::tests::search_reports_the_strategy_it_used
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking

test result: FAILED. 116 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.00s

*** result: Failure(101)
