*** crates/core/src/cursor.rs:209:13: replace >= with < in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace >= with < in gallop
@@ -201,17 +201,17 @@
         }
         self.doc()
     }
 }
 
 /// Index of the first posting `>= target` at or after `from`, found by
 /// exponentially widening a window and then bisecting it.
 fn gallop(postings: &[Posting], from: usize, target: DocId) -> usize {
-    if from >= postings.len() {
+    if from < /* ~ changed by cargo-mutants ~ */ postings.len() {
         return postings.len();
     }
     let mut step = 1;
     let mut low = from;
     while low + step < postings.len() && postings[low + step].doc < target {
         low += step;
         step *= 2;
     }

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12928507) panicked at crates/core/src/cursor.rs:352:9:
assertion failed: cursor.block_upper_bound() > 0.0

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12928510) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 1
  left: Some(256)
 right: Some(2)

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12928513) panicked at crates/core/src/cursor.rs:333:9:
assertion `left == right` failed
  left: 0
 right: 128

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 131 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
