*** crates/core/src/cursor.rs:209:5: replace gallop -> usize with 0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace gallop -> usize with 0
@@ -201,36 +201,17 @@
         }
         self.doc()
     }
 }
 
 /// Index of the first posting `>= target` at or after `from`, found by
 /// exponentially widening a window and then bisecting it.
 fn gallop(postings: &[Posting], from: usize, target: DocId) -> usize {
-    if from >= postings.len() {
-        return postings.len();
-    }
-    let mut step = 1;
-    let mut low = from;
-    while low + step < postings.len() && postings[low + step].doc < target {
-        low += step;
-        step *= 2;
-    }
-    let high = (low + step).min(postings.len());
-
-    low + postings[low..high]
-        .binary_search_by(|p| {
-            if p.doc < target {
-                std::cmp::Ordering::Less
-            } else {
-                std::cmp::Ordering::Greater
-            }
-        })
-        .unwrap_or_else(|insertion| insertion)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::analyzer::Analyzer;
     use crate::index::{Index, BLOCK_SIZE};

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12926794) panicked at crates/core/src/cursor.rs:278:9:
assertion `left == right` failed: cursor moved back
  left: Some(128)
 right: Some(200)

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12926793) panicked at crates/core/src/cursor.rs:269:13:
assertion `left == right` failed: target 1
  left: Some(0)
 right: Some(2)

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12926791) panicked at crates/core/src/cursor.rs:299:9:
assertion `left == right` failed
  left: Some(384)
 right: Some(389)

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 128 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
