*** crates/core/src/cursor.rs:214:15: replace + with * in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with * in gallop
@@ -206,17 +206,17 @@
 /// Index of the first posting `>= target` at or after `from`, found by
 /// exponentially widening a window and then bisecting it.
 fn gallop(postings: &[Posting], from: usize, target: DocId) -> usize {
     if from >= postings.len() {
         return postings.len();
     }
     let mut step = 1;
     let mut low = from;
-    while low + step < postings.len() && postings[low + step].doc < target {
+    while low * /* ~ changed by cargo-mutants ~ */ step < postings.len() && postings[low + step].doc < target {
         low += step;
         step *= 2;
     }
     let high = (low + step).min(postings.len());
 
     low + postings[low..high]
         .binary_search_by(|p| {
             if p.doc < target {

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12934107) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: Some(159)
 right: Some(200)

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12934103) panicked at crates/core/src/cursor.rs:214:77:
index out of bounds: the len is 1 but the index is 1

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12934106) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 63
  left: Some(62)
 right: Some(64)

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
