*** crates/core/src/cursor.rs:214:67: replace < with > in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with > in gallop
@@ -206,17 +206,17 @@
 /// Index of the first posting `>= target` at or after `from`, found by
 /// exponentially widening a window and then bisecting it.
 fn gallop(postings: &[Posting], from: usize, target: DocId) -> usize {
     if from >= postings.len() {
         return postings.len();
     }
     let mut step = 1;
     let mut low = from;
-    while low + step < postings.len() && postings[low + step].doc < target {
+    while low + step < postings.len() && postings[low + step].doc > /* ~ changed by cargo-mutants ~ */ target {
         low += step;
         step *= 2;
     }
     let high = (low + step).min(postings.len());
 
     low + postings[low..high]
         .binary_search_by(|p| {
             if p.doc < target {

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12935865) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: Some(129)
 right: Some(200)

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12935867) panicked at crates/core/src/cursor.rs:333:9:
assertion `left == right` failed
  left: 1
 right: 128

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12935864) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 1
  left: Some(254)
 right: Some(2)

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 131 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
