*** crates/core/src/cursor.rs:214:67: replace < with <= in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with <= in gallop
@@ -206,17 +206,17 @@
 /// Index of the first posting `>= target` at or after `from`, found by
 /// exponentially widening a window and then bisecting it.
 fn gallop(postings: &[Posting], from: usize, target: DocId) -> usize {
     if from >= postings.len() {
         return postings.len();
     }
     let mut step = 1;
     let mut low = from;
-    while low + step < postings.len() && postings[low + step].doc < target {
+    while low + step < postings.len() && postings[low + step].doc <= /* ~ changed by cargo-mutants ~ */ target {
         low += step;
         step *= 2;
     }
     let high = (low + step).min(postings.len());
 
     low + postings[low..high]
         .binary_search_by(|p| {
             if p.doc < target {

*** result: Success
