*** crates/core/src/cursor.rs:215:13: replace += with *= in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace += with *= in gallop
@@ -207,17 +207,17 @@
 /// exponentially widening a window and then bisecting it.
 fn gallop(postings: &[Posting], from: usize, target: DocId) -> usize {
     if from >= postings.len() {
         return postings.len();
     }
     let mut step = 1;
     let mut low = from;
     while low + step < postings.len() && postings[low + step].doc < target {
-        low += step;
+        low *= /* ~ changed by cargo-mutants ~ */ step;
         step *= 2;
     }
     let high = (low + step).min(postings.len());
 
     low + postings[low..high]
         .binary_search_by(|p| {
             if p.doc < target {
                 std::cmp::Ordering::Less

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12940590) panicked at crates/core/src/cursor.rs:220:19:
range start index 154 out of range for slice of length 128

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12940589) panicked at crates/core/src/cursor.rs:220:19:
range start index 68 out of range for slice of length 63

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12940591) panicked at crates/core/src/cursor.rs:220:19:
range start index 146 out of range for slice of length 128

failures:
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 132 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
