*** crates/core/src/cursor.rs:218:21: replace + with - in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with - in gallop
@@ -210,17 +210,17 @@
         return postings.len();
     }
     let mut step = 1;
     let mut low = from;
     while low + step < postings.len() && postings[low + step].doc < target {
         low += step;
         step *= 2;
     }
-    let high = (low + step).min(postings.len());
+    let high = (low - /* ~ changed by cargo-mutants ~ */ step).min(postings.len());
 
     low + postings[low..high]
         .binary_search_by(|p| {
             if p.doc < target {
                 std::cmp::Ordering::Less
             } else {
                 std::cmp::Ordering::Greater
             }

---- cursor::tests::remaining_counts_the_postings_still_ahead stdout ----

thread 'cursor::tests::remaining_counts_the_postings_still_ahead' (12943507) panicked at crates/core/src/cursor.rs:218:16:
attempt to subtract with overflow

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12943504) panicked at crates/core/src/cursor.rs:218:16:
attempt to subtract with overflow

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12943502) panicked at crates/core/src/cursor.rs:218:16:
attempt to subtract with overflow

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 127 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
