*** crates/core/src/cursor.rs:220:9: replace + with - in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace + with - in gallop
@@ -212,17 +212,17 @@
     let mut step = 1;
     let mut low = from;
     while low + step < postings.len() && postings[low + step].doc < target {
         low += step;
         step *= 2;
     }
     let high = (low + step).min(postings.len());
 
-    low + postings[low..high]
+    low - /* ~ changed by cargo-mutants ~ */ postings[low..high]
         .binary_search_by(|p| {
             if p.doc < target {
                 std::cmp::Ordering::Less
             } else {
                 std::cmp::Ordering::Greater
             }
         })
         .unwrap_or_else(|insertion| insertion)

---- cursor::tests::a_long_skip_decodes_only_the_landing_block stdout ----

thread 'cursor::tests::a_long_skip_decodes_only_the_landing_block' (12945746) panicked at crates/core/src/cursor.rs:318:9:
assertion `left == right` failed
  left: Some(385)
 right: Some(389)

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12945749) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: Some(182)
 right: Some(200)

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12945748) panicked at crates/core/src/cursor.rs:220:5:
attempt to subtract with overflow

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 127 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
