*** crates/core/src/cursor.rs:222:22: replace < with <= in gallop

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with <= in gallop
@@ -214,17 +214,17 @@
     while low + step < postings.len() && postings[low + step].doc < target {
         low += step;
         step *= 2;
     }
     let high = (low + step).min(postings.len());
 
     low + postings[low..high]
         .binary_search_by(|p| {
-            if p.doc < target {
+            if p.doc <= /* ~ changed by cargo-mutants ~ */ target {
                 std::cmp::Ordering::Less
             } else {
                 std::cmp::Ordering::Greater
             }
         })
         .unwrap_or_else(|insertion| insertion)
 }

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12949796) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: Some(201)
 right: Some(200)

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12949792) panicked at crates/core/src/cursor.rs:352:9:
assertion failed: cursor.block_upper_bound() > 0.0

---- cursor::tests::advance_to_matches_a_linear_scan_on_every_target stdout ----

thread 'cursor::tests::advance_to_matches_a_linear_scan_on_every_target' (12949795) panicked at crates/core/src/cursor.rs:288:13:
assertion `left == right` failed: target 4
  left: Some(6)
 right: Some(4)

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::remaining_counts_the_postings_still_ahead
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 130 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
