*** crates/core/src/cursor.rs:56:9: replace BlockCursor<'a>::load_block with ()

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::load_block with ()
@@ -48,23 +48,17 @@
             bm25,
             avg_doc_len,
         };
         cursor.load_block(0);
         cursor
     }
 
     fn load_block(&mut self, block: usize) {
-        self.block = block;
-        self.at = 0;
-        self.decoded = if block < self.term.blocks().len() {
-            self.term.decode_block(block)
-        } else {
-            Vec::new()
-        };
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Document the cursor points at, or `None` once exhausted.
     pub fn doc(&self) -> Option<DocId> {
         self.decoded.get(self.at).map(|p| p.doc)
     }
 
     /// Term frequency in the current document.

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12861112) panicked at crates/core/src/cursor.rs:249:9:
assertion `left == right` failed
  left: None
 right: Some(0)

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12861115) panicked at crates/core/src/cursor.rs:291:9:
assertion `left == right` failed: cursor moved back
  left: None
 right: Some(200)

---- cursor::tests::advance_walks_every_posting_across_block_boundaries stdout ----

thread 'cursor::tests::advance_walks_every_posting_across_block_boundaries' (12861117) panicked at crates/core/src/cursor.rs:259:42:
called `Option::unwrap()` on a `None` value

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher

test result: FAILED. 114 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
