*** crates/core/src/cursor.rs:58:33: replace < with == in BlockCursor<'a>::load_block

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace < with == in BlockCursor<'a>::load_block
@@ -50,17 +50,17 @@
         };
         cursor.load_block(0);
         cursor
     }
 
     fn load_block(&mut self, block: usize) {
         self.block = block;
         self.at = 0;
-        self.decoded = if block < self.term.blocks().len() {
+        self.decoded = if block == /* ~ changed by cargo-mutants ~ */ self.term.blocks().len() {
             self.term.decode_block(block)
         } else {
             Vec::new()
         };
     }
 
     /// Document the cursor points at, or `None` once exhausted.
     pub fn doc(&self) -> Option<DocId> {

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12861438) panicked at crates/core/src/cursor.rs:352:9:
assertion failed: cursor.block_upper_bound() > 0.0

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12861442) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: None
 right: Some(200)

---- cursor::tests::advance_walks_every_posting_across_block_boundaries stdout ----

thread 'cursor::tests::advance_walks_every_posting_across_block_boundaries' (12861443) panicked at crates/core/src/cursor.rs:265:42:
called `Option::unwrap()` on a `None` value

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    cursor::tests::remaining_counts_the_postings_still_ahead
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks

test result: FAILED. 113 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.66s

*** result: Failure(101)
