*** crates/core/src/cursor.rs:67:9: replace BlockCursor<'a>::doc -> Option<DocId> with None

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::doc -> Option<DocId> with None
@@ -59,17 +59,17 @@
             self.term.decode_block(block)
         } else {
             Vec::new()
         };
     }
 
     /// Document the cursor points at, or `None` once exhausted.
     pub fn doc(&self) -> Option<DocId> {
-        self.decoded.get(self.at).map(|p| p.doc)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Term frequency in the current document.
     pub fn tf(&self) -> u32 {
         self.decoded.get(self.at).map_or(0, Posting::tf)
     }
 
     pub fn idf(&self) -> f32 {

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12864030) panicked at crates/core/src/cursor.rs:255:9:
assertion `left == right` failed
  left: None
 right: Some(0)

---- cursor::tests::advance_to_never_moves_backwards stdout ----

thread 'cursor::tests::advance_to_never_moves_backwards' (12864032) panicked at crates/core/src/cursor.rs:297:9:
assertion `left == right` failed: cursor moved back
  left: None
 right: Some(200)

---- cursor::tests::advance_walks_every_posting_across_block_boundaries stdout ----

thread 'cursor::tests::advance_walks_every_posting_across_block_boundaries' (12864033) panicked at crates/core/src/cursor.rs:265:42:
called `Option::unwrap()` on a `None` value

failures:
    cursor::tests::a_long_skip_decodes_only_the_landing_block
    cursor::tests::a_new_cursor_points_at_the_first_document
    cursor::tests::advance_to_matches_a_linear_scan_on_every_target
    cursor::tests::advance_to_never_moves_backwards
    cursor::tests::advance_walks_every_posting_across_block_boundaries
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking

test result: FAILED. 114 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.73s

*** result: Failure(101)
