*** crates/core/src/cursor.rs:72:9: replace BlockCursor<'a>::tf -> u32 with 0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::tf -> u32 with 0
@@ -64,17 +64,17 @@
 
     /// Document the cursor points at, or `None` once exhausted.
     pub fn doc(&self) -> Option<DocId> {
         self.decoded.get(self.at).map(|p| p.doc)
     }
 
     /// Term frequency in the current document.
     pub fn tf(&self) -> u32 {
-        self.decoded.get(self.at).map_or(0, Posting::tf)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn idf(&self) -> f32 {
         self.idf
     }
 
     pub fn is_exhausted(&self) -> bool {
         self.doc().is_none()

---- cursor::tests::a_new_cursor_points_at_the_first_document stdout ----

thread 'cursor::tests::a_new_cursor_points_at_the_first_document' (12865310) panicked at crates/core/src/cursor.rs:256:9:
assertion `left == right` failed
  left: 0
 right: 1

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12865328) panicked at crates/core/src/engine.rs:428:9:
assertion failed: results[0].score > 0.0

---- searcher::tests::documents_matching_more_clauses_rank_higher stdout ----

thread 'searcher::tests::documents_matching_more_clauses_rank_higher' (12865381) panicked at crates/core/src/searcher.rs:489:9:
assertion `left == right` failed: d2 has both terms and must come first
  left: "d0"
 right: "d2"

failures:
    cursor::tests::a_new_cursor_points_at_the_first_document
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    searcher::tests::scores_are_positive_and_ordered
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 127 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.88s

*** result: Failure(101)
