*** crates/core/src/cursor.rs:72:9: replace BlockCursor<'a>::tf -> u32 with 1

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::tf -> u32 with 1
@@ -64,17 +64,17 @@
 
     /// Document the cursor points at, or `None` once exhausted.
     pub fn doc(&self) -> Option<DocId> {
         self.decoded.get(self.at).map(|p| p.doc)
     }
 
     /// Term frequency in the current document.
     pub fn tf(&self) -> u32 {
-        self.decoded.get(self.at).map_or(0, Posting::tf)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn idf(&self) -> f32 {
         self.idf
     }
 
     pub fn is_exhausted(&self) -> bool {
         self.doc().is_none()

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12866271) panicked at crates/core/src/cursor.rs:306:9:
assertion `left == right` failed
  left: 1
 right: 0

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12866393) panicked at crates/core/src/searcher.rs:673:9:
assertion `left == right` failed
  left: [160, 288, 128, 96, 256, 224, 64, 32, 192, 0]
 right: [0, 160, 288, 128, 96, 256, 224, 64, 32, 192]

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12866392) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term0` limit 1: different ranking
  left: 81
 right: 1

failures:
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 133 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.99s

*** result: Failure(101)
