*** crates/core/src/cursor.rs:76:9: replace BlockCursor<'a>::idf -> f32 with 1.0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::idf -> f32 with 1.0
@@ -68,17 +68,17 @@
     }
 
     /// Term frequency in the current document.
     pub fn tf(&self) -> u32 {
         self.decoded.get(self.at).map_or(0, Posting::tf)
     }
 
     pub fn idf(&self) -> f32 {
-        self.idf
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_exhausted(&self) -> bool {
         self.doc().is_none()
     }
 
     /// Highest score this term can contribute to *any* document.
     pub fn term_upper_bound(&self) -> f32 {

---- service::tests::queries_keep_being_answered_while_the_index_is_rebuilt stdout ----

thread 'service::tests::queries_keep_being_answered_while_the_index_is_rebuilt' (12868182) panicked at crates/core/src/service.rs:286:9:
readers never got to run

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12868203) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12868169) panicked at crates/core/src/searcher.rs:673:9:
assertion `left == right` failed
  left: [0, 160, 4, 12, 288, 8, 20, 128, 16, 28]
 right: [0, 160, 288, 128, 96, 256, 224, 64, 32, 192]

failures:
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 132 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.98s

*** result: Failure(101)
