*** crates/core/src/cursor.rs:80:9: replace BlockCursor<'a>::is_exhausted -> bool with true

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::is_exhausted -> bool with true
@@ -72,17 +72,17 @@
         self.decoded.get(self.at).map_or(0, Posting::tf)
     }
 
     pub fn idf(&self) -> f32 {
         self.idf
     }
 
     pub fn is_exhausted(&self) -> bool {
-        self.doc().is_none()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Highest score this term can contribute to *any* document.
     pub fn term_upper_bound(&self) -> f32 {
         self.bm25.score(
             self.term.max_tf(),
             self.term.min_len(),
             self.avg_doc_len,

---- searcher::tests::documents_matching_more_clauses_rank_higher stdout ----

thread 'searcher::tests::documents_matching_more_clauses_rank_higher' (12869909) panicked at crates/core/src/searcher.rs:489:26:
index out of bounds: the len is 0 but the index is 0

---- searcher::tests::limit_truncates_the_ranking stdout ----

thread 'searcher::tests::limit_truncates_the_ranking' (12869911) panicked at crates/core/src/searcher.rs:523:9:
assertion `left == right` failed
  left: 0
 right: 2

---- searcher::tests::optional_terms_match_any_document stdout ----

thread 'searcher::tests::optional_terms_match_any_document' (12869912) panicked at crates/core/src/searcher.rs:483:9:
assertion `left == right` failed
  left: []
 right: ["d0", "d2", "d3"]

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 120 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.87s

*** result: Failure(101)
