*** crates/core/src/cursor.rs:80:9: replace BlockCursor<'a>::is_exhausted -> bool with false

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::is_exhausted -> bool with false
@@ -72,17 +72,17 @@
         self.decoded.get(self.at).map_or(0, Posting::tf)
     }
 
     pub fn idf(&self) -> f32 {
         self.idf
     }
 
     pub fn is_exhausted(&self) -> bool {
-        self.doc().is_none()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Highest score this term can contribute to *any* document.
     pub fn term_upper_bound(&self) -> f32 {
         self.bm25.score(
             self.term.max_tf(),
             self.term.min_len(),
             self.avg_doc_len,

---- cursor::tests::skipping_past_the_end_exhausts_the_cursor stdout ----

thread 'cursor::tests::skipping_past_the_end_exhausts_the_cursor' (12870522) panicked at crates/core/src/cursor.rs:305:9:
assertion failed: cursor.is_exhausted()

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12870555) panicked at crates/core/src/searcher.rs:194:50:
pivot cursor is not exhausted

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12870524) panicked at crates/core/src/searcher.rs:194:50:
pivot cursor is not exhausted

failures:
    cursor::tests::skipping_past_the_end_exhausts_the_cursor
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::both_formats_return_the_same_results
    engine::tests::search_reports_the_strategy_it_used
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking

test result: FAILED. 116 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.06s

*** result: Failure(101)
