*** crates/core/src/cursor.rs:85:9: replace BlockCursor<'a>::term_upper_bound -> f32 with 0.0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::term_upper_bound -> f32 with 0.0
@@ -77,22 +77,17 @@
     }
 
     pub fn is_exhausted(&self) -> bool {
         self.doc().is_none()
     }
 
     /// Highest score this term can contribute to *any* document.
     pub fn term_upper_bound(&self) -> f32 {
-        self.bm25.score(
-            self.term.max_tf(),
-            self.term.min_len(),
-            self.avg_doc_len,
-            self.idf,
-        )
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Highest score this term can contribute to a document *in the current
     /// block*.
     ///
     /// Tighter than the term-wide bound, because a block covers a narrow slice
     /// of the collection — which is exactly what makes block-max pruning skip
     /// more than plain WAND.

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12871569) panicked at crates/core/src/cursor.rs:342:9:
assertion failed: cursor.block_upper_bound() <= term_bound

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12871578) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- searcher::tests::documents_matching_more_clauses_rank_higher stdout ----

thread 'searcher::tests::documents_matching_more_clauses_rank_higher' (12871643) panicked at crates/core/src/searcher.rs:489:26:
index out of bounds: the len is 0 but the index is 0

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 119 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
