*** crates/core/src/cursor.rs:85:9: replace BlockCursor<'a>::term_upper_bound -> f32 with 1.0

*** mutation diff:
--- crates/core/src/cursor.rs
+++ replace BlockCursor<'a>::term_upper_bound -> f32 with 1.0
@@ -77,22 +77,17 @@
     }
 
     pub fn is_exhausted(&self) -> bool {
         self.doc().is_none()
     }
 
     /// Highest score this term can contribute to *any* document.
     pub fn term_upper_bound(&self) -> f32 {
-        self.bm25.score(
-            self.term.max_tf(),
-            self.term.min_len(),
-            self.avg_doc_len,
-            self.idf,
-        )
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Highest score this term can contribute to a document *in the current
     /// block*.
     ///
     /// Tighter than the term-wide bound, because a block covers a narrow slice
     /// of the collection — which is exactly what makes block-max pruning skip
     /// more than plain WAND.

---- cursor::tests::a_block_bound_is_never_looser_than_the_term_bound stdout ----

thread 'cursor::tests::a_block_bound_is_never_looser_than_the_term_bound' (12872251) panicked at crates/core/src/cursor.rs:348:9:
assertion failed: cursor.block_upper_bound() <= term_bound

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12872330) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term3 term7` limit 3: different ranking
  left: 8
 right: 128

---- searcher::tests::pruning_holds_under_retuned_ranking_parameters stdout ----

thread 'searcher::tests::pruning_holds_under_retuned_ranking_parameters' (12872332) panicked at crates/core/src/searcher.rs:632:13:
assertion `left == right` failed: k1=2 b=0.3 changed the ranking
  left: [48, 16, 0, 64, 32, 80, 128, 96, 144, 112]
 right: [48, 16, 0, 64, 32, 80, 240, 400, 560, 720]

failures:
    cursor::tests::a_block_bound_is_never_looser_than_the_term_bound
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters

test result: FAILED. 135 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.88s

*** result: Failure(101)
