*** crates/core/src/topk.rs:101:37: replace == with != in TopK::offer

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace == with != in TopK::offer
@@ -93,17 +93,17 @@
         if self.heap.len() < self.k {
             self.heap.push(candidate);
             return;
         }
         // `Less` means "better" under this reversed ordering. Equality keeps
         // the incumbent, so ties resolve towards the document seen first —
         // which, since documents arrive in ascending id order, is the lower id.
         if let Some(worst) = self.heap.peek() {
-            if candidate.cmp(worst) == Ordering::Less {
+            if candidate.cmp(worst) != /* ~ changed by cargo-mutants ~ */ Ordering::Less {
                 self.heap.pop();
                 self.heap.push(candidate);
             }
         }
     }
 
     /// Consumes the collector, returning the hits best first.
     pub fn into_sorted(self) -> Vec<Hit> {

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12971436) panicked at crates/core/src/searcher.rs:677:9:
assertion failed: wand.scored < exhaustive.scored

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12971470) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

---- searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking stdout ----

thread 'searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking' (12971435) panicked at crates/core/src/searcher.rs:600:21:
assertion `left == right` failed: `term0 term1` limit 1: different ranking
  left: 478
 right: 479

failures:
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps
    topk::tests::keeps_only_the_best_k
    topk::tests::the_threshold_rises_as_better_documents_arrive
    topk::tests::ties_resolve_towards_the_lower_document_id

test result: FAILED. 129 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
