*** crates/core/src/topk.rs:110:9: replace TopK::into_sorted -> Vec<Hit> with vec![]

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace TopK::into_sorted -> Vec<Hit> with vec![]
@@ -102,31 +102,17 @@
                 self.heap.pop();
                 self.heap.push(candidate);
             }
         }
     }
 
     /// Consumes the collector, returning the hits best first.
     pub fn into_sorted(self) -> Vec<Hit> {
-        let mut hits: Vec<Hit> = self
-            .heap
-            .into_iter()
-            .map(|c| Hit {
-                doc: c.doc,
-                score: c.score,
-            })
-            .collect();
-        hits.sort_unstable_by(|a, b| {
-            b.score
-                .partial_cmp(&a.score)
-                .unwrap_or(Ordering::Equal)
-                .then(a.doc.cmp(&b.doc))
-        });
-        hits
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn collect(k: usize, scored: &[(DocId, f32)]) -> Vec<(DocId, f32)> {

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12972235) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12972236) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12972262) panicked at crates/core/src/engine.rs:426:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::excluded_terms_are_removed_from_the_results
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::phrases_require_adjacency_in_the_right_order
    searcher::tests::required_terms_intersect
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_new_service_serves_generation_one
    service::tests::a_snapshot_keeps_answering_from_the_generation_it_took

test result: FAILED. 119 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
