*** crates/core/src/topk.rs:38:17: delete match arm (true, false) in <impl Ord for Candidate>::cmp

*** mutation diff:
--- crates/core/src/topk.rs
+++ delete match arm (true, false) in <impl Ord for Candidate>::cmp
@@ -30,17 +30,17 @@
 
 impl Ord for Candidate {
     fn cmp(&self, other: &Self) -> Ordering {
         // Reversed on score so the heap root is the lowest scoring candidate.
         other
             .score
             .partial_cmp(&self.score)
             .unwrap_or_else(|| match (self.score.is_nan(), other.score.is_nan()) {
-                (true, false) => Ordering::Less,
+                 /* ~ changed by cargo-mutants ~ */
                 (false, true) => Ordering::Greater,
                 _ => Ordering::Equal,
             })
             // On a tie the *larger* document id sorts first, so it is the one
             // evicted: ties resolve towards the lower id, matching the order a
             // full sort produces.
             .then(self.doc.cmp(&other.doc))
     }

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12950781) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
