*** crates/core/src/topk.rs:39:17: delete match arm (false, true) in <impl Ord for Candidate>::cmp

*** mutation diff:
--- crates/core/src/topk.rs
+++ delete match arm (false, true) in <impl Ord for Candidate>::cmp
@@ -31,17 +31,17 @@
 impl Ord for Candidate {
     fn cmp(&self, other: &Self) -> Ordering {
         // Reversed on score so the heap root is the lowest scoring candidate.
         other
             .score
             .partial_cmp(&self.score)
             .unwrap_or_else(|| match (self.score.is_nan(), other.score.is_nan()) {
                 (true, false) => Ordering::Less,
-                (false, true) => Ordering::Greater,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => Ordering::Equal,
             })
             // On a tie the *larger* document id sorts first, so it is the one
             // evicted: ties resolve towards the lower id, matching the order a
             // full sort produces.
             .then(self.doc.cmp(&other.doc))
     }
 }

---- service::tests::queries_keep_being_answered_while_the_index_is_rebuilt stdout ----

thread 'service::tests::queries_keep_being_answered_while_the_index_is_rebuilt' (12951639) panicked at crates/core/src/service.rs:286:9:
readers never got to run

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12951660) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
