*** crates/core/src/topk.rs:75:28: replace < with == in TopK::threshold

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace < with == in TopK::threshold
@@ -67,17 +67,17 @@
         }
     }
 
     /// Score a new candidate must beat to enter the result set.
     ///
     /// Zero until the collector is full: before that, every scoring document is
     /// worth keeping.
     pub fn threshold(&self) -> f32 {
-        if self.heap.len() < self.k {
+        if self.heap.len() == /* ~ changed by cargo-mutants ~ */ self.k {
             0.0
         } else {
             self.heap.peek().map_or(0.0, |worst| worst.score)
         }
     }
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12955985) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 1
 right: 2

---- searcher::tests::optional_terms_match_any_document stdout ----

thread 'searcher::tests::optional_terms_match_any_document' (12956054) panicked at crates/core/src/searcher.rs:483:9:
assertion `left == right` failed
  left: ["d0", "d3"]
 right: ["d0", "d2", "d3"]

---- service::tests::a_snapshot_keeps_answering_from_the_generation_it_took stdout ----

thread 'service::tests::a_snapshot_keeps_answering_from_the_generation_it_took' (12956068) panicked at crates/core/src/service.rs:221:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    engine::tests::a_shared_term_ranks_both_documents
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    searcher::tests::pruning_holds_under_retuned_ranking_parameters
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_snapshot_keeps_answering_from_the_generation_it_took
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    service::tests::reindexing_publishes_the_next_generation
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 122 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
