*** crates/core/src/topk.rs:75:28: replace < with <= in TopK::threshold

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace < with <= in TopK::threshold
@@ -67,17 +67,17 @@
         }
     }
 
     /// Score a new candidate must beat to enter the result set.
     ///
     /// Zero until the collector is full: before that, every scoring document is
     /// worth keeping.
     pub fn threshold(&self) -> f32 {
-        if self.heap.len() < self.k {
+        if self.heap.len() <= /* ~ changed by cargo-mutants ~ */ self.k {
             0.0
         } else {
             self.heap.peek().map_or(0.0, |worst| worst.score)
         }
     }
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {

---- service::tests::queries_keep_being_answered_while_the_index_is_rebuilt stdout ----

thread 'service::tests::queries_keep_being_answered_while_the_index_is_rebuilt' (12957938) panicked at crates/core/src/service.rs:286:9:
readers never got to run

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12957925) panicked at crates/core/src/searcher.rs:677:9:
assertion failed: wand.scored < exhaustive.scored

---- topk::tests::the_threshold_is_zero_until_it_fills_up stdout ----

thread 'topk::tests::the_threshold_is_zero_until_it_fills_up' (12957990) panicked at crates/core/src/topk.rs:162:9:
assertion `left == right` failed: worst of the three
  left: 0.0
 right: 2.0

failures:
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    topk::tests::the_threshold_is_zero_until_it_fills_up
    topk::tests::the_threshold_rises_as_better_documents_arrive
    topk::tests::would_accept_agrees_with_offer

test result: FAILED. 130 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
