*** crates/core/src/topk.rs:75:9: replace TopK::threshold -> f32 with 0.0

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace TopK::threshold -> f32 with 0.0
@@ -67,21 +67,17 @@
         }
     }
 
     /// Score a new candidate must beat to enter the result set.
     ///
     /// Zero until the collector is full: before that, every scoring document is
     /// worth keeping.
     pub fn threshold(&self) -> f32 {
-        if self.heap.len() < self.k {
-            0.0
-        } else {
-            self.heap.peek().map_or(0.0, |worst| worst.score)
-        }
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {
         self.heap.len() < self.k || score > self.threshold()
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.

---- searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking stdout ----

thread 'searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking' (12953394) panicked at crates/core/src/searcher.rs:677:9:
assertion failed: wand.scored < exhaustive.scored

---- topk::tests::the_threshold_is_zero_until_it_fills_up stdout ----

thread 'topk::tests::the_threshold_is_zero_until_it_fills_up' (12953459) panicked at crates/core/src/topk.rs:158:9:
assertion `left == right` failed: worst of the three
  left: 0.0
 right: 2.0

---- topk::tests::the_threshold_rises_as_better_documents_arrive stdout ----

thread 'topk::tests::the_threshold_rises_as_better_documents_arrive' (12953460) panicked at crates/core/src/topk.rs:166:9:
assertion `left == right` failed
  left: 0.0
 right: 1.0

failures:
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches
    topk::tests::the_threshold_is_zero_until_it_fills_up
    topk::tests::the_threshold_rises_as_better_documents_arrive
    topk::tests::would_accept_agrees_with_offer

test result: FAILED. 131 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
