*** crates/core/src/topk.rs:75:9: replace TopK::threshold -> f32 with 1.0

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace TopK::threshold -> f32 with 1.0
@@ -67,21 +67,17 @@
         }
     }
 
     /// Score a new candidate must beat to enter the result set.
     ///
     /// Zero until the collector is full: before that, every scoring document is
     /// worth keeping.
     pub fn threshold(&self) -> f32 {
-        if self.heap.len() < self.k {
-            0.0
-        } else {
-            self.heap.peek().map_or(0.0, |worst| worst.score)
-        }
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {
         self.heap.len() < self.k || score > self.threshold()
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12954191) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12954192) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- engine::tests::search_returns_titles_scores_and_snippets stdout ----

thread 'engine::tests::search_returns_titles_scores_and_snippets' (12954211) panicked at crates/core/src/engine.rs:426:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::pruning_and_exhaustive_scoring_return_the_same_ranking
    service::tests::a_mapped_index_can_be_adopted_without_rebuilding_it
    service::tests::a_new_service_serves_generation_one
    service::tests::a_snapshot_keeps_answering_from_the_generation_it_took
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt

test result: FAILED. 120 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
