*** crates/core/src/topk.rs:84:25: replace < with > in TopK::would_accept

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace < with > in TopK::would_accept
@@ -76,17 +76,17 @@
             0.0
         } else {
             self.heap.peek().map_or(0.0, |worst| worst.score)
         }
     }
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {
-        self.heap.len() < self.k || score > self.threshold()
+        self.heap.len() > /* ~ changed by cargo-mutants ~ */ self.k || score > self.threshold()
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.
     pub fn offer(&mut self, doc: DocId, score: f32) {
         if self.k == 0 {
             return;
         }
         let candidate = Candidate { doc, score };

---- service::tests::queries_keep_being_answered_while_the_index_is_rebuilt stdout ----

thread 'service::tests::queries_keep_being_answered_while_the_index_is_rebuilt' (12962643) panicked at crates/core/src/service.rs:286:9:
readers never got to run

---- snapshot::tests::readers_keep_making_progress_while_a_writer_swaps stdout ----

thread 'snapshot::tests::readers_keep_making_progress_while_a_writer_swaps' (12962663) panicked at crates/core/src/snapshot.rs:315:9:
readers never got to run

failures:
    service::tests::queries_keep_being_answered_while_the_index_is_rebuilt
    snapshot::tests::readers_keep_making_progress_while_a_writer_swaps

test result: FAILED. 136 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
