*** crates/core/src/topk.rs:84:43: replace > with >= in TopK::would_accept

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace > with >= in TopK::would_accept
@@ -76,17 +76,17 @@
             0.0
         } else {
             self.heap.peek().map_or(0.0, |worst| worst.score)
         }
     }
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {
-        self.heap.len() < self.k || score > self.threshold()
+        self.heap.len() < self.k || score >= /* ~ changed by cargo-mutants ~ */ self.threshold()
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.
     pub fn offer(&mut self, doc: DocId, score: f32) {
         if self.k == 0 {
             return;
         }
         let candidate = Candidate { doc, score };

---- topk::tests::would_accept_agrees_with_offer stdout ----

thread 'topk::tests::would_accept_agrees_with_offer' (12966234) panicked at crates/core/src/topk.rs:179:9:
a tie does not displace the incumbent

failures:
    topk::tests::would_accept_agrees_with_offer

test result: FAILED. 137 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
