*** crates/core/src/topk.rs:89:19: replace == with != in TopK::offer

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace == with != in TopK::offer
@@ -81,17 +81,17 @@
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {
         self.heap.len() < self.k || score > self.threshold()
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.
     pub fn offer(&mut self, doc: DocId, score: f32) {
-        if self.k == 0 {
+        if self.k != /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
         let candidate = Candidate { doc, score };
         if self.heap.len() < self.k {
             self.heap.push(candidate);
             return;
         }
         // `Less` means "better" under this reversed ordering. Equality keeps

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12967859) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12967860) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- searcher::tests::limit_truncates_the_ranking stdout ----

thread 'searcher::tests::limit_truncates_the_ranking' (12967928) panicked at crates/core/src/searcher.rs:523:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::excluded_terms_are_removed_from_the_results
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::phrases_require_adjacency_in_the_right_order
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 113 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
