*** crates/core/src/topk.rs:89:9: replace TopK::offer with ()

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace TopK::offer with ()
@@ -81,33 +81,17 @@
 
     /// Returns whether a document scoring `score` could enter the result set.
     pub fn would_accept(&self, score: f32) -> bool {
         self.heap.len() < self.k || score > self.threshold()
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.
     pub fn offer(&mut self, doc: DocId, score: f32) {
-        if self.k == 0 {
-            return;
-        }
-        let candidate = Candidate { doc, score };
-        if self.heap.len() < self.k {
-            self.heap.push(candidate);
-            return;
-        }
-        // `Less` means "better" under this reversed ordering. Equality keeps
-        // the incumbent, so ties resolve towards the document seen first —
-        // which, since documents arrive in ascending id order, is the lower id.
-        if let Some(worst) = self.heap.peek() {
-            if candidate.cmp(worst) == Ordering::Less {
-                self.heap.pop();
-                self.heap.push(candidate);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Consumes the collector, returning the hits best first.
     pub fn into_sorted(self) -> Vec<Hit> {
         let mut hits: Vec<Hit> = self
             .heap
             .into_iter()
             .map(|c| Hit {

---- engine::tests::an_engine_round_trips_through_a_mapped_index stdout ----

thread 'engine::tests::an_engine_round_trips_through_a_mapped_index' (12966987) panicked at crates/core/src/engine.rs:491:9:
assertion `left == right` failed
  left: 0
 right: 1

---- engine::tests::a_shared_term_ranks_both_documents stdout ----

thread 'engine::tests::a_shared_term_ranks_both_documents' (12966986) panicked at crates/core/src/engine.rs:436:9:
assertion `left == right` failed
  left: 0
 right: 2

---- searcher::tests::excluded_terms_are_removed_from_the_results stdout ----

thread 'searcher::tests::excluded_terms_are_removed_from_the_results' (12967051) panicked at crates/core/src/searcher.rs:501:9:
assertion `left == right` failed
  left: []
 right: ["d0", "d2"]

failures:
    engine::tests::a_shared_term_ranks_both_documents
    engine::tests::an_engine_round_trips_through_a_mapped_index
    engine::tests::search_returns_titles_scores_and_snippets
    searcher::tests::a_smaller_limit_prunes_more
    searcher::tests::block_max_bounds_skip_whole_blocks
    searcher::tests::documents_matching_more_clauses_rank_higher
    searcher::tests::excluded_terms_are_removed_from_the_results
    searcher::tests::limit_truncates_the_ranking
    searcher::tests::optional_terms_match_any_document
    searcher::tests::phrases_require_adjacency_in_the_right_order
    searcher::tests::pruning_can_be_turned_off_without_changing_the_ranking
    searcher::tests::pruning_scores_far_fewer_documents_than_it_matches

test result: FAILED. 112 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
