*** crates/core/src/topk.rs:93:28: replace < with <= in TopK::offer

*** mutation diff:
--- crates/core/src/topk.rs
+++ replace < with <= in TopK::offer
@@ -85,17 +85,17 @@
     }
 
     /// Offers a scored document, keeping it only if it belongs in the top `k`.
     pub fn offer(&mut self, doc: DocId, score: f32) {
         if self.k == 0 {
             return;
         }
         let candidate = Candidate { doc, score };
-        if self.heap.len() < self.k {
+        if self.heap.len() <= /* ~ changed by cargo-mutants ~ */ self.k {
             self.heap.push(candidate);
             return;
         }
         // `Less` means "better" under this reversed ordering. Equality keeps
         // the incumbent, so ties resolve towards the document seen first —
         // which, since documents arrive in ascending id order, is the lower id.
         if let Some(worst) = self.heap.peek() {
             if candidate.cmp(worst) == Ordering::Less {

---- searcher::tests::limit_truncates_the_ranking stdout ----

thread 'searcher::tests::limit_truncates_the_ranking' (12970550) panicked at crates/core/src/searcher.rs:523:9:
assertion `left == right` failed
  left: 3
 right: 2

---- topk::tests::keeps_only_the_best_k stdout ----

thread 'topk::tests::keeps_only_the_best_k' (12970619) panicked at crates/core/src/topk.rs:146:9:
assertion `left == right` failed
  left: [(1, 5.0), (2, 3.0), (0, 1.0)]
 right: [(1, 5.0), (2, 3.0)]

---- topk::tests::ties_resolve_towards_the_lower_document_id stdout ----

thread 'topk::tests::ties_resolve_towards_the_lower_document_id' (12970622) panicked at crates/core/src/topk.rs:152:9:
assertion `left == right` failed
  left: [(1, 2.0), (7, 2.0), (9, 2.0)]
 right: [(1, 2.0), (7, 2.0)]

failures:
    searcher::tests::limit_truncates_the_ranking
    topk::tests::keeps_only_the_best_k
    topk::tests::the_threshold_rises_as_better_documents_arrive
    topk::tests::ties_resolve_towards_the_lower_document_id

test result: FAILED. 134 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
